{"talks":[{"id":3537,"eventid":21,"title":"Microservices done right or SOA lessons learnt","description":"SOA has been around for a while, now microservices is the new black, that's cool, but lets look at what we learnt when we failed and succeeded implementing SOA.","type":"talk","language":"English","topic":"Architectures","level":"Beginner","room_order":4,"room":"BL.27.0.7","date":"2016-11-26","starttime":"14:10:00","endtime":"14:50:00"},{"id":3539,"eventid":21,"title":"Public speaking for geeks","description":"Speaking in public is not easy, especially for geeks, that tend to be too technical, or too shy, or too something...\r\nIn this session we'll start with some basic tips and we'll see how to dramatically improve our results using well defined techniques.\r\nWe'll also see (with practical examples) how to deal with problems during speeches, elevator pitches, product presentations, interviews, and so on.\r\n\r\nPublic speaking skills are not useful to conference speakers only, everybody needs to improve them, especially geeks!","type":"talk","language":"Italian","topic":"Inspirational","level":"Beginner","room_order":6,"room":"BL.27.1.5","date":"2016-11-26","starttime":"16:20:00","endtime":"17:00:00"},{"id":3544,"eventid":21,"title":"Continuous budgeting","description":"Oggi si parla sempre piu di continuous integration, deploy e delivery. Ma come va gestito il budget in questi contesti? Le pratiche agili portano alla miopia nel medio-lungo periodo concentrandosi sul risolvere problemi presenti oggi e sfruttando tattiche utili nel breve periodo. Il talk vuole mostrare alcune idee (perfettibili ma concrete) su come sviluppare pensando anche al fatto che esiste non solo un budget per creare nuovo codice, ma anche uno per mantenere quello vecchio e la relativa infrastruttura e che entrambi devono essere presi in consideazione.","type":"talk","language":"Italian","topic":"Inspirational","level":"Intermediate","room_order":1,"room":"BL.27.0.2","date":"2016-11-25","starttime":"14:10:00","endtime":"14:50:00"},{"id":3551,"eventid":21,"title":"The new features of PHP 7","description":"In this talk I'll present some of the new features of PHP 7. I will present the scalar type and return type declarations, the spaceship and null coalescing operators, the anonymous classes, the new Error exception, the security features, etc. Moreover, I will present some benchmarks and use cases of PHP 7 regarding the huge performance improvement.","type":"talk","language":"English","topic":"Programming","level":"Beginner","room_order":0,"room":"BL.27.0.1","date":"2016-11-25","starttime":"11:30:00","endtime":"12:10:00"},{"id":3560,"eventid":21,"title":"How to Apply Big Data Analytics and Machine Learning to Real Time Processing","description":"The world gets connected more and more every year due to Mobile, Cloud and Internet of Things. \"Big Data\" is currently a big hype. Large amounts of historical data are stored in Hadoop to find patterns, e.g. for predictive maintenance or cross-selling. But how to increase revenue or reduce risks in new transactions?\r\n\r\n\"Fast Data\" via stream processing is the solution to embed patterns into future actions in real-time. This session discusses how machine learning and analytic models with R, Spark MLlib, H2O, etc. can be integrated into real-time event processing. A live demo concludes the session","type":"talk","language":"English","topic":"AI\/Machine Learning","level":"Beginner","room_order":0,"room":"BL.27.0.1","date":"2016-11-25","starttime":"14:10:00","endtime":"14:50:00"},{"id":3567,"eventid":21,"title":"SASI, Cassandra on the full text search ride !","description":"Apache Cassandra is a scalable database with high availability features. But they come with severe limitations in term of querying capabilities.\r\n\r\nSince the introduction of SASI in Cassandra 3.4, the limitations belong to the pass. Now you can create performant indices on your columns as well as benefit from full text search capabilities with the introduction of the new LIKE %term% syntax.\r\n\r\nTo illustrate how SASI works, we'll use a database of 100 000 albums and artists.","type":"talk","language":"English","topic":"Cloud\/Bigdata","level":"Beginner","room_order":2,"room":"BL.27.0.3","date":"2016-11-25","starttime":"15:10:00","endtime":"15:50:00"},{"id":3584,"eventid":21,"title":"Talking and listening to web pages","description":"As web developers, our job is to build nice, fast, and reliable websites, web apps, or web services. But our role isn't limited to this. We have to build products not only for our ideal users but for a range of people as wide as possible. Today's browsers help in achieving this goal providing APIs created with this scope in mind. One of these APIs is the Web Speech API that provides speech input and text-to-speech output features.\r\n\r\nIn this talk you'll learn what the Web Speech API is and how it can improve the way users, especially those with disabilities, perform tasks in your web pages.","type":"talk","language":"English","topic":"Design\/Frontend","level":"Intermediate","room_order":2,"room":"BL.27.0.3","date":"2016-11-25","starttime":"17:10:00","endtime":"17:50:00"},{"id":3586,"eventid":21,"title":"Graph databases and the \"panama papers\"","description":"In spring 2016 the first press reports regarding the \"panama papers\" were released. With almost 3TB of raw data this was by far the largest leak of data worldwide. This talk gives some technical insights who the ICIJ (International Consortium Of Investigate Journalists) worked with that amount of data to provide journalist an easy to use interface for doing their research.\r\n\r\nAside other technologies one core component was a graph database. In a live demo in the panama papers dataset we'll explore to power and conciseness of the graph query language \"Cypher\".","type":"talk","language":"English","topic":"Cloud\/Bigdata","level":"Beginner","room_order":2,"room":"BL.27.0.3","date":"2016-11-25","starttime":"11:30:00","endtime":"12:10:00"},{"id":3590,"eventid":21,"title":"Living on the Edge (Service): Bundling Microservices to Optimize Consumption for Devices with Spring Cloud & Netflix","description":"Devices (phones, tablets, etc.) already consume most services\/data, but they have to get those services somewhere! In this session, learn how to use proven patterns & open source software to quickly and effectively build edge services that marshal & streamline communication between your key services and end-users with devices in hand. The presenter will demonstrate how to develop & manage microservices & expose them via an edge service, securely, using OSS tools employed by Netflix to keep  movies streaming globally 24x7.","type":"talk","language":"English","topic":"Architectures","level":"Beginner","room_order":0,"room":"BL.27.0.1","date":"2016-11-26","starttime":"11:30:00","endtime":"12:10:00"},{"id":3608,"eventid":21,"title":"Gang of Four Patterns in a Functional Light","description":"Il Gang of Four e stata una Bibbia per tutti gli sviluppattori della mia generazione. Il suo pregio e stato darci un vocabolario comune: quando un programmatore dice \"qui ho usato uno strategy pattern\" tutti sanno di cosa parla. Il problema e che gran parte dei pattern elencati nel libro sono un workaround per sopperire ad un'astrazione mancante: le higher order functions. Le lambdas introdotte in Java 8 consentono anche ai Javisti di liberarsi di questa sovrastruttura. Lo scopo del talk e mostrare in una live coding session come reimplementare i piu usati GoF pattern in maniera funzionale.","type":"talk","language":"Italian","topic":"Programming","level":"Intermediate","room_order":0,"room":"BL.27.0.1","date":"2016-11-26","starttime":"14:10:00","endtime":"14:50:00"},{"id":3609,"eventid":21,"title":"Thirty months of microservices. Stairway to heaven or highway to hell?","description":"Microservices are the next hype. Websites are full of introducing posts, books are being written and conferences organized. There's big promises of scalability and flexibility. However, when you are knee deep in mud as an architect, developer or tester, it's hard to find out how to get there. Sander Hoogendoorn, independent craftsman and CTO of Klaverblad Insurances, discusses the long and winding road his projects, greenfield and brownfield, have travelled. Sander will e.g. address polyglot persistence, DDD, bounded contexts, modeling HTTP\/REST, continuous delivery and many lessons learned.","type":"talk","language":"English","topic":"Architectures","level":"Intermediate","room_order":1,"room":"BL.27.0.2","date":"2016-11-26","starttime":"15:10:00","endtime":"15:50:00"},{"id":3680,"eventid":21,"title":"Stop using Bootstrap please!","description":"Bootstrap e di sicuro diventato uno dei Framework front-end che tutti conoscono ed hanno utilizzato almeno una volta. Per alcuni Front-end developer e diventato uno standard de facto. Ma e davvero tutto oro quello che luccica? La sua velocita di utilizzo e in realta assimilabile ad un prestito. Hai chiavi in mano, ma sai quanto andrai a pagare nel tempo?\r\n\r\nDurante questo talk vedremo quali sono le insidie che si nascondono dietro questo (e similari) framework e come sostituirlo grazie a tecnologie e metodologie moderne.","type":"talk","language":"Italian","topic":"Design\/Frontend","level":"Intermediate","room_order":4,"room":"BL.27.0.7","date":"2016-11-26","starttime":"16:20:00","endtime":"17:00:00"},{"id":3682,"eventid":21,"title":"Put yourself in the appsec pipe","description":"Create secure software is more than run a penetration test or a code review, just before the deploy and having some automatism can help you in have a low error rate process.\r\n\r\nIn this talk we will go through the pipeline building process, explaining how to automate some boring tasks dedicating ourself to\r\nhaving fun, playing tricks like pros. At the end of our journey both tech people than security managers, will have the feeling that using the pipeline approach, they can lower vulnerabilities, with an affordable time to market so to make the bosses happy.","type":"talk","language":"Italian","topic":"Security","level":"Intermediate","room_order":6,"room":"BL.27.1.5","date":"2016-11-25","starttime":"11:30:00","endtime":"12:10:00"},{"id":3699,"eventid":21,"title":"Geospatial Graphs made easy with OrientDB","description":"Modeling and querying persistent data structures can be tricky when they involve\r\nsemi-structured data, complex relationships (with deep traversal) and physical information \r\nlike geographical positions, areas, shapes and so on.\r\nBad news is that almost all your applications will have to manage such kind of data.\r\n\r\nIn this presentation we will see how to use OrientDB v2.2 Document-Graph engine and its new \r\nGeospatial Indexes to efficiently manage ad query connected, spatial information. \r\nVery few slides, a lot of live coding, I promise!","type":"talk","language":"English","topic":"Cloud\/Bigdata","level":"Intermediate","room_order":5,"room":"BL.27.1.2","date":"2016-11-25","starttime":"17:10:00","endtime":"17:50:00"},{"id":3725,"eventid":21,"title":"Build apps for Apple Watch","description":"AppleWatch is selling like crazy and anyone want his favorite apps on the wrist of his users.\r\n\r\nHow can you build a counterpart app for Apple Watch?\r\n\r\nApple has already released watchOS 2 with big news for developer and the third version of watchOS is arriving with a new Apple Watch! How can you take advantages of this new things?\r\n\r\nThis talk will explain how an iOS developer can migrate his app to Apple Watch.","type":"talk","language":"English","topic":"Mobile","level":"Beginner","room_order":5,"room":"BL.27.1.2","date":"2016-11-25","starttime":"12:30:00","endtime":"13:10:00"},{"id":3742,"eventid":21,"title":"The first fifteen lives of a software engineer","description":"Changing jobs is like reincarnating. One life ends and another begins. Only difference is that you are the same person and you get to keep all your memories, all your experience. Using everything you learn in one life to become better in your next one is the key to success. In this talk Nikos dives into his past lives trying to give advice to his younger self and at the same time explaining to the audience the good and the bad parts of frequent job hopping.","type":"talk","language":"English","topic":"Inspirational","level":"Beginner","room_order":2,"room":"BL.27.0.3","date":"2016-11-26","starttime":"11:30:00","endtime":"12:10:00"},{"id":3761,"eventid":21,"title":"Cross-platform Apps using Xamarin and MvvmCross","description":"Learn about best practices in cross-platform development to enable you to deliver the highest quality Apps.\r\n\r\nMvvmCross is the most populair Xamarin framework to build great apps. I will explain and demo how you can start your project with these frameworks and give a deeper insight into MvvmCross.","type":"talk","language":"English","topic":"Mobile","level":"Intermediate","room_order":5,"room":"BL.27.1.2","date":"2016-11-25","starttime":"11:30:00","endtime":"12:10:00"},{"id":3801,"eventid":21,"title":"Developing apps for developing countries","description":"App development for developing countries introduces a slew of new challenges: smartphones function as a user's main point of connection, local demand for use of mobile apps and web is different and the infrastructure places strict limits on users' internet data volume.\r\n\r\nIn this talk we'll discuss how the mobile world looks like in developing countries: what apps are like, what are the common devices and and what are the current initiatives to increase internet connectivity. \r\n\r\nWe'll then discuss further potential solutions like efficiently compressing data in the device.","type":"talk","language":"English","topic":"Mobile","level":"Beginner","room_order":6,"room":"BL.27.1.5","date":"2016-11-25","starttime":"14:10:00","endtime":"14:50:00"},{"id":3851,"eventid":21,"title":"RxJS - destroy the state machine!","description":"Learn our story how we discovered RxJS, how it helped us to bring a massive state machine into an elegant event-based reactive platform. In this talk I am going to give you an overview of RxJS and why should you use it. I am going to talk about how once we adopted the reactive approach, it completely changed the way we think about state and state programming. All this with code examples.","type":"talk","language":"English","topic":"Javascript","level":"Intermediate","room_order":3,"room":"BL.27.0.5","date":"2016-11-26","starttime":"15:10:00","endtime":"15:50:00"},{"id":3857,"eventid":21,"title":"Nobody Likes Working With You","description":"It doesn't matter how efficient your code is, if your team mates don't like working with you, you are a bad software developer.\r\n\r\nMost of your time is spent communicating with others (emails, tasks, comments on pull requests) If you can't do it properly your colleagues won't take your opinions into consideration or will be afraid to ask for them. \r\nAnd a team unable to communicate and speak openly will end up producing bad code.\r\nIn this presentation I will talk about how to: \r\n- Give constructive feedback\r\n- Comment on others code nicely\r\n- Disagree without offending\r\n- Express your ideas","type":"talk","language":"English","topic":"Inspirational","level":"Beginner","room_order":3,"room":"BL.27.0.5","date":"2016-11-26","starttime":"14:10:00","endtime":"14:50:00"},{"id":3862,"eventid":21,"title":"Mobile testing like you mean it","description":"If behavior driven development and mobile apps sound like fun, join this hands-on session to explore automated acceptance testing using SpecFlow, Xamarin.UITest and Xamarin Test Cloud.  \r\n\r\nLet's take a swing at turning specifications into concrete, executable and easy-to-repeat behavior. The result is powerful UI acceptance testing by performing common behaviors like pressing buttons, making swipe gestures and entering text. Everything automated, nonetheless!","type":"talk","language":"English","topic":"Mobile","level":"Advanced","room_order":2,"room":"BL.27.0.3","date":"2016-11-26","starttime":"15:10:00","endtime":"15:50:00"},{"id":3868,"eventid":21,"title":"Scaling applications using AngularJS and TypeScript","description":"The future of web development is component based. Building your application in a modular way using decoupled components gives you the power to reuse code and increase testability. This talk is going to walk you through main features in angular 2 and explain the benefits of using TypeScript when implementing your applications.","type":"talk","language":"English","topic":"Javascript","level":"Beginner","room_order":2,"room":"BL.27.0.3","date":"2016-11-25","starttime":"14:10:00","endtime":"14:50:00"},{"id":3883,"eventid":21,"title":"Elixir and Lambda talk with a Telegram bot","description":"The talk demonstrates a working system made of an Elixir program running on a Raspberry Pi that scans the Wi-Fi spectrum and collects presence data; an AWS Lambda JavaScript function that receives those data and stores them into a DynamoDB instance; a Telegram bot, also running on Lambda, which sends alerts based on the number of presences. The focus will be on the overall architecture and the most important parts of the code. We'll show some Lambda automation tools and how to test the components locally. All the source code will be on GitHub. Ideal talk to get started with those technologies.","type":"talk","language":"English","topic":"Programming","level":"Intermediate","room_order":5,"room":"BL.27.1.2","date":"2016-11-26","starttime":"16:20:00","endtime":"17:00:00"},{"id":3886,"eventid":21,"title":"React  - render() to DOM","description":"Understand how React really works. What happens between our call to setState() and until we see things change in our browser. This is a more advanced talk for developers familiar with React.","type":"talk","language":"English","topic":"Javascript","level":"Intermediate","room_order":0,"room":"BL.27.0.1","date":"2016-11-25","starttime":"17:10:00","endtime":"17:50:00"},{"id":3899,"eventid":21,"title":"Beyond Hacktivism - why #policymatters","description":"We live in a brave new world. Public policy is not just about Assange, Snowden and Dotcom anymore. Legal battles are being fought in courtrooms in EU and US for the future of software development.\r\n \r\nIn the last 12 months, we've had several issues directly impacting developers pop up on our governments' radars, and we've had limited reach. Legality of Encryption. Digital Single Market. Android Antitrust. Freedom to use APIs, and more. \r\n\r\nWe'll look at the most pressing issues that could affect the lives of millions of developers, and hundreds of millions of citizens.","type":"talk","language":"English","topic":"Inspirational","level":"Beginner","room_order":2,"room":"BL.27.0.3","date":"2016-11-25","starttime":"12:30:00","endtime":"13:10:00"},{"id":3900,"eventid":21,"title":"Android Testing Support Library: The Nitty Gritty","description":"8 years since Android's been released we finally have a proper Google-supported solution for testing in the Testing Support Library. We'll go through the various stages of it, explore it's (not so) hidden features and learn how to use it to build better apps. We will cover things such as (breaking the) test Rules, (outrunning the) test Runners and how to make most of tools such as Espresso &  Firebase Test Lab.","type":"talk","language":"English","topic":"Mobile","level":"Beginner","room_order":4,"room":"BL.27.0.7","date":"2016-11-26","starttime":"15:10:00","endtime":"15:50:00"},{"id":3907,"eventid":21,"title":"Sviluppare applicazioni cross-platform con Xamarin Forms e il framework Prism","description":"Xamarin Forms consente di sviluppare applicazioni cross-platform utilizzando C# e di condividere non solo la business logic (come consente gia di fare l'approccio tradizionale), ma anche l'interfaccia utente, grazie ad un linguaggio basato sullo XAML, i cui elementi vengono poi convertiti in tempo reale in controlli nativi, garantendo perci una user experience coerente con quella attesa dall'utente su Android, iOS e Windows. Nel corso di questa sessione vedremo come strutturare al meglio un progetto Xamarin Forms, grazie al pattern MVVM e al framework open source Prism.","type":"talk","language":"Italian","topic":"Mobile","level":"Intermediate","room_order":2,"room":"BL.27.0.3","date":"2016-11-26","starttime":"14:10:00","endtime":"14:50:00"},{"id":3908,"eventid":21,"title":"Progressive Web Apps: trick or real magic?","description":"Con il passare del tempo i siti e le applicazioni diventano sempre piu pesanti e gli utenti consumano i loro contenuti prevalentemente attraverso dispositivi mobile. Due cose che non vanno certo d'accordo.\r\nRendere le applicazioni performanti e un compito difficile soprattutto quando ci sono variabili che non possiamo controllare, come la connessione. I Service Worker e altre tecniche che stanno dietro le Progressive Web Apps possono essere una risposta concreta a questo problema.","type":"talk","language":"Italian","topic":"Javascript","level":"Intermediate","room_order":1,"room":"BL.27.0.2","date":"2016-11-26","starttime":"12:30:00","endtime":"13:10:00"},{"id":3958,"eventid":21,"title":"Game Design Principles: What you should know about game design whether you create games or not","description":"Game Design is the art of creating a game. It's a very fascinating subject, under many aspects, as it requires knowledge of psychology, visual design, mathematics, software engineering, animation, user experience and much more.\r\nIn this workshop we will introduce the definition of game and the main components of game design, presenting the challenges and the aspects of this science, analysing the design choices of some of the most popular titles of the past. We will also discover why many of the concepts of game design are also useful to web or mobile product designers in general.","type":"talk","language":"Italian","topic":"Game Dev","level":"Beginner","room_order":7,"room":"BL.27.1.1","date":"2016-11-25","starttime":"16:10:00","endtime":"16:50:00"},{"id":3988,"eventid":21,"title":"Functional Reactive Programming with Kotlin on Android","description":"Reactive programming is a paradigm oriented around data flows and propagation of changes.  Kotlin is a programming language intended to be a better Java, and it's designed to be usable and readable across large teams with skill and discipline variances.\r\nDespite its object-oriented building blocks, Kotlin fits well in the functional reactive programming landscape. In this essay, I will deep-dive into the most relevant aspects of FRP in Kotlin focusing on the advantages that everyone can get when using this approach to build an Android app.","type":"talk","language":"English","topic":"Mobile","level":"Intermediate","room_order":4,"room":"BL.27.0.7","date":"2016-11-25","starttime":"17:10:00","endtime":"17:50:00"},{"id":4003,"eventid":21,"title":"MicroMonolith - Top anti-patterns of adopting distributed system","description":"The age of monoliths is gone. Cloud is not going away, it is here to stay. Distributed computing is on the rise. The time is now to catch up with the trend.\r\nJoin me in this talk and be part of a journey from monolithic system to microservices based distributed application.  This won't be an easy road. Such a fundamental change in how we do software is riddled with anti-patterns and sub-optimal choices. My team has done it! And we want to share our path so that yours will be much more simpler. All you need to do is come and listen.","type":"talk","language":"English","topic":"Architectures","level":"Intermediate","room_order":3,"room":"BL.27.0.5","date":"2016-11-26","starttime":"12:30:00","endtime":"13:10:00"},{"id":4011,"eventid":21,"title":"Getting started with Go","description":"This talk focuses on people which are interested the Go programming language and want to learn it.\r\nIn it I will present the various resources new gophers have to learn Go, what are the usual pitfalls and how to get help when they are stuck.","type":"talk","language":"English","topic":"Golang","level":"Beginner","room_order":3,"room":"BL.27.0.5","date":"2016-11-25","starttime":"12:30:00","endtime":"13:10:00"},{"id":4016,"eventid":21,"title":"Knowledge is Power: Getting out of trouble by understanding Git","description":"Git is rapidly taking over the development workplace. One of the downsides of high-level tools is that they can hide the details of what is happening under the hood; when things go wrong it can be hard to understand why git behaves the way it does. But at its core Git consists of a few simple concepts that, when understood, make it a much more intuitive tool. This talk introduces these core Git concepts and uses them to clarify some examples of seemingly counterintuitive behaviour. It also introduces some of Git's less-known features and tricks that are useful to have in your arsenal.","type":"talk","language":"English","topic":"DevOps","level":"Intermediate","room_order":3,"room":"BL.27.0.5","date":"2016-11-25","starttime":"16:10:00","endtime":"16:50:00"},{"id":4083,"eventid":21,"title":"The (almost) lost art of Smalltalk","description":"This talk is not about how to survive your next elevator ride but about the grandfather of all Object-Oriented Programming language. Even 40 years after its inception, no other language can hold a candle to the elegance and purity of this dinosaur of computer science. With the recent appearance of new open-source implementations and web-development frameworks, it seems like Smalltalk is about to receive its second wind. In this talk I will introduce you to its exciting interactive capabilities and demonstrate how much fun web development can be. But warning: Smalltalk is highly addictive.","type":"talk","language":"English","topic":"Programming","level":"Beginner","room_order":3,"room":"BL.27.0.5","date":"2016-11-26","starttime":"11:30:00","endtime":"12:10:00"},{"id":4107,"eventid":21,"title":"Hacking for Salone: Drone Races","description":"This year for the Salone del Mobile at frog,  we came up with a funky experiment, based on Drones, Android, and VR.\r\nIn this talk, your hosts will walk you through our Drone Race experiment, touching topics like real-time computer vision, reactive programming for mobile, indoor positioning and (wheeled) Drones hacking.\r\nThe variety and complexity of these topics is equal to its coolness though, so you may be puzzled asking yourself: \"Where do I start?\"\r\nWe will share experiences and lots of code, so that you can start right away.","type":"talk","language":"English","topic":"VR\/AR","level":"Intermediate","room_order":7,"room":"BL.27.1.4","date":"2016-11-26","starttime":"16:20:00","endtime":"17:00:00"},{"id":4137,"eventid":21,"title":"To ~65K methods limit and beyond!","description":"This talk focuses on analyzing the infamous 65K methods limit for Android apps, from a pragmatic and down-to-earth perspective for developers. You will get to understand what exactly this problem is about and why it exists in the first place. Moreover, we will go through the possible solutions, each one of them presented with pros and cons. At the end of this talk, you should be able to evaluate which solution best suits your app, and even if you need a solution in the first place.","type":"talk","language":"English","topic":"Mobile","level":"Advanced","room_order":4,"room":"BL.27.0.7","date":"2016-11-25","starttime":"16:10:00","endtime":"16:50:00"},{"id":4151,"eventid":21,"title":"Coding for Accessibility","description":"Have you ever tried navigating your web app with a screenreader? Want to make sure the next person that does has a better experience?\r\n\r\nCoding with accessibility in mind is important from both a usage and legal standpoint. This talk will provide a convincing argument for including accessibility as a key product design consideration, and will provide the tools and most effective methods for making your website or app more accessible for users with visual challenges.","type":"talk","language":"English","topic":"Design\/Frontend","level":"Intermediate","room_order":2,"room":"BL.27.0.3","date":"2016-11-25","starttime":"16:10:00","endtime":"16:50:00"},{"id":4154,"eventid":21,"title":"Understanding Angular 2","description":"Angular 2 is a complete rewrite of the AngularJS framework, which introduces new approaches and leverages the latest technologies. Simplifying and generalizing core concepts, the performance is improved and the range of capabilities is broadened. In this session Shmuela will help you understand the core concepts of Angular 2 apps: the component-based architecture, dependency injection, change detection, and more.","type":"talk","language":"English","topic":"Javascript","level":"Beginner","room_order":1,"room":"BL.27.0.2","date":"2016-11-25","starttime":"15:10:00","endtime":"15:50:00"},{"id":4172,"eventid":21,"title":"Hearthstone: an analysis of game network protocols.","description":"In this talk we will delve into one of the most played games of the moment: Blizzard Interactive's Hearthstone.\r\nWe will focus on analysing Hearthstone's implementation of Google Protocol Buffers and proceed to show how the game handles communication by providing some code examples and by showing how to create a Deck Tracking application.","type":"talk","language":"English","topic":"Game Dev","level":"Intermediate","room_order":8,"room":"BL.27.1.4","date":"2016-11-25","starttime":"17:10:00","endtime":"17:50:00"},{"id":4232,"eventid":21,"title":"A-Frame in the Virtual World, small bricks of virtual reality web","description":"Let's prototype VR experiences running in your browser! We don't need any complex tools but a bag full of VR bricks designed by Mozilla (aframe.io) and our knowledge of html5 and js.","type":"talk","language":"English","topic":"VR\/AR","level":"Intermediate","room_order":8,"room":"BL.27.1.4","date":"2016-11-25","starttime":"12:30:00","endtime":"13:10:00"},{"id":4246,"eventid":21,"title":"Next generation of frontend architectures","description":"Will Reactive programming be the default choice for modern apps? When would you want to use event emitters as opposed to event streams with operators? In this session you'll find the answers to those questions and much more! If you want to learn more about Reactive Programming that's exactly the session for you!","type":"talk","language":"English","topic":"Javascript","level":"Advanced","room_order":1,"room":"BL.27.0.2","date":"2016-11-26","starttime":"14:10:00","endtime":"14:50:00"},{"id":4258,"eventid":21,"title":"Combining AI and IoT. New Industrial Revolution in our houses and in the Universe","description":"During last year we finally realized that Artificial Intelligence is functionally necessary to bring the huge number of sensor devices online. And it definitely will be even more important in making sense of data streamed in from IoT devices. So what will happen when we will learn how to combine AI, IoT and general tools?","type":"talk","language":"English","topic":"AI\/Machine Learning","level":"Beginner","room_order":0,"room":"BL.27.0.1","date":"2016-11-25","starttime":"16:10:00","endtime":"16:50:00"},{"id":4280,"eventid":21,"title":"Can Super Coders be a reality?","description":"Alan Turing was the most talented potential super coder. What happened to him is a tragic tale. He was victimized and marginalized despite proving himself by breaking the Enigma code. Sadly, such instances continue to happen so coders are not able to code. Code in motion is a concept I'd like to define as code which is useful to the final consumer. Otherwise code is a hindrance. I will share 3 corporate examples, propose solutions to develop business vision along with coding and conclude by appealing to coders present to give the 'code in motion' a higher priority compared to coding in itself.","type":"keynote","language":"English","topic":"Inspirational","level":"Intermediate","room_order":0,"room":"BL.27.0.1","date":"2016-11-26","starttime":"10:00:00","endtime":"10:20:00"},{"id":4290,"eventid":21,"title":"Alla scoperta di Roslyn: i compilatori .NET open source e le loro API","description":"Microsoft ha rilasciato i compilatori C# e Visual Basic sotto forma di progetto open-source, noto come Roslyn e rilasciato sotto il nome di .NET Compiler Platform. Con Roslyn, i compilatori funzionano come servizi che espongono API per l'analisi del codice. In questa sessione faremo un'introduzione ai nuovi compiler-as-a-service, alle loro API e vedremo come usarli per scenari di code generation","type":"talk","language":"Italian","topic":"Programming","level":"Advanced","room_order":7,"room":"BL.27.1.1","date":"2016-11-25","starttime":"15:10:00","endtime":"15:50:00"},{"id":4292,"eventid":21,"title":"TDD: cose che ho imparato negli ultimi 12 anni","description":"Sul TDD se ne sentono di tutti colori: chi dice che sia la soluzione di tutti i problemi, chi invece dice che sia morto. Eppure TDD e uno strumento fondamentale per scrivere codice bene, velocemente, con divertimento e profitto.\r\n\r\nRaccontera cose che ho imparato in 12 anni di esperienza sul campo, alcune delle quali sono apparse di sfuggita nel libro di Kent Beck e poi sparite dal radar.\r\n\r\nParlera di Test List, Isolated Test, scomposizione del problema in assi ortogonali; di design evolutivo vs. anticipatorio; E di che cosa significhi veramente \"la cosa piu semplice che possa funzionare\"","type":"talk","language":"Italian","topic":"Programming","level":"Intermediate","room_order":1,"room":"BL.27.0.2","date":"2016-11-25","starttime":"12:30:00","endtime":"13:10:00"},{"id":4299,"eventid":21,"title":"Big data, small dashboard","description":"Big data is the new black. We have more data than we could use, but what we really need is information. The typical dashboard is completely crammed with colourful 3D pies, uncountable lines and tons of extra-thick tables. And nobody understands anything.\r\n\r\nKnowledge is power. But to be able to know you first have to understand.\r\n\r\nIn this talk we shall see how to transform a terribile mess into a clean and informative dashboard, moving step by step and explaining the reasonings between each passage.\r\n\r\nAt my signal... unleash knowledge!","type":"talk","language":"English","topic":"Cloud\/Bigdata","level":"Intermediate","room_order":5,"room":"BL.27.1.2","date":"2016-11-25","starttime":"16:10:00","endtime":"16:50:00"},{"id":4302,"eventid":21,"title":"From a developer to a teamleader ! an unexpected journey","description":"Sometimes a developer faces the question or even a tough choice : should I become a teamleader or a manager?\r\nI cannot answer this question for anyone, but I can tell others what experience I had.\r\n\r\nI've met two types of teamleaders in the industry  one that is more an architect and doesn't manage estimates or prioritisation, but is just responsible for the architecture and the code quality; and the second one that does both management and architecture. The latter one is the most interesting one, and is the topic of the talk.","type":"talk","language":"English","topic":"Inspirational","level":"Beginner","room_order":0,"room":"BL.27.0.1","date":"2016-11-25","starttime":"15:10:00","endtime":"15:50:00"},{"id":4306,"eventid":21,"title":"Come rendere il proprio prodotto una bomba creandogli una intera community intorno!","description":"Creare una community di sviluppatori ed utilizzatori intorno al proprio progetto ","type":"talk","language":"Italian","topic":"Inspirational","level":"Intermediate","room_order":3,"room":"BL.27.0.5","date":"2016-11-25","starttime":"17:10:00","endtime":"17:50:00"},{"id":4339,"eventid":21,"title":"Virtual Reality gaming: analysis of Yon Paradox development","description":"Since the Kickstarter campaign in August 2012, Oculus Rift targeted games for Virtual Reality. \"If a game works, then everything will work\".\r\nEven though VR has been used a lot for business and industrial purposes, the community of VR and game developers pushed forward the platform and the limits of this new medium. \r\nIn this talk I will analyze the process of design and development of Yon Paradox, sharing our results on what went good and what didn't work.","type":"talk","language":"English","topic":"VR\/AR","level":"Intermediate","room_order":8,"room":"BL.27.1.4","date":"2016-11-25","starttime":"15:10:00","endtime":"15:50:00"},{"id":4348,"eventid":21,"title":"Search on the fly: how to lighten your Big Data","description":"The talk presents a new technique of realtime single entity information extraction and investigation. The technique eliminates regular refresh and persistence of data within the search engine (ETL), providing real-time access to source data and improving response times using in-memory data techniques.\r\n\r\nThe solution presented is a concrete solution with live customers, based upon real business needs.\r\n\r\nI will explain the architectural overview, the technology stack used based on Apache Lucene library, the accomplished results and how to scale out the solution.","type":"talk","language":"Italian","topic":"Cloud\/Bigdata","level":"Intermediate","room_order":0,"room":"BL.27.0.1","date":"2016-11-26","starttime":"15:10:00","endtime":"15:50:00"},{"id":4365,"eventid":21,"title":"Promises Are So Passe","description":"Promises saved JavaScript from callback hell, but we're not out of the woods yet. Anybody who's written heavily asynchronous code knows there's still pain in the promise'd land, from the flood of extra ceremony required to the frustratingly fractured function scope.\r\n\r\nFortunately, this isn't the end of the line, and with generators and JavaScript's upcoming async\/await syntax we can do even better. In this talk we'll look at where asynchronous development is going next, how it's going solve your problems, and what you need to do to put it into practice today.","type":"talk","language":"English","topic":"Javascript","level":"Intermediate","room_order":0,"room":"BL.27.0.1","date":"2016-11-25","starttime":"12:30:00","endtime":"13:10:00"},{"id":4393,"eventid":21,"title":"Monarch, Google's Planet-Scale Monitoring Infrastructure","description":"Google runs very large and complex distributed systems. Keeping them healthy is a full time job in itself. The first step is knowing what is going on in our planet-wide extensive infrastructure. \r\nThis talk is a technical deep dive into our state-of-the art monitoring systems: what challenges we faced, what solution we found, what lessons we learned.","type":"talk","language":"English","topic":"DevOps","level":"Advanced","room_order":4,"room":"BL.27.0.7","date":"2016-11-25","starttime":"15:10:00","endtime":"15:50:00"},{"id":4410,"eventid":21,"title":"Distributed System explained (with NodeJS)","description":"Since I've been working on distributed systems I always wanted to back in time and teach myself what I know now, in order to avoid the silly mistakes I did! Things like vector clocks, the CAP theorem, how replication really works (and why it's needed), what BASE means and in general all about how this stuff really works! This is the speech I'd needed wheI wrote my first DT, and it's something you need to know if you fancy working in this area. And we will also be coding some very simple examples in NodeJS, as I am not a big believer of diagrams... show me code!","type":"talk","language":"Italian","topic":"Architectures","level":"Beginner","room_order":1,"room":"BL.27.0.2","date":"2016-11-25","starttime":"17:10:00","endtime":"17:50:00"},{"id":4414,"eventid":21,"title":"Kubernetes and lastminute.com: our course towards better scalability and processes","description":"Kubernetes adoption is straight forward when starting from scratch or in public clouds, but what the journey looks like when your starting point is a legacy infrastructure with high-traffic? \r\nIn this talk we present our experience that begun almost 1 year ago and challenged everything inside our organisation. Developer teams changed the way they work, product owners benefit from the new speed achieved and the need of new roles emerged in IT department.\r\nWe will explain our lessons learnt and the way to get the best out of this solution.","type":"talk","language":"English","topic":"DevOps","level":"Intermediate","room_order":3,"room":"BL.27.0.5","date":"2016-11-25","starttime":"11:30:00","endtime":"12:10:00"},{"id":4415,"eventid":21,"title":"Sviluppare applicazioni nell'era dei \"Big Data\" con Scala e Spark","description":"Scala e un linguaggio di programmazione general purpose multi-paradigma pensato per realizzare applicazioni ad alte prestazioni che girano all'interno della Java Virtual Machine. Spark e il framework \"Big Data\", basato su Scala, piu flessibile e performante disponibile oggi sul mercato. Durante il talk verra introdotto il linguaggio Scala e verranno mostrate le potenzialita legate al suo utilizzo nell'ambito dello sviluppo di applicazioni web di ultima generazione compresa la possibilita di processamento parallelo di grandi quantita di dati attraverso l'utilizzo del framework Spark.","type":"talk","language":"Italian","topic":"Cloud\/Bigdata","level":"Intermediate","room_order":2,"room":"BL.27.0.3","date":"2016-11-26","starttime":"12:30:00","endtime":"13:10:00"},{"id":4416,"eventid":21,"title":"Serverless Data Architecture at scale on Google Cloud Platform","description":"Let's say you are in charge of the design of a data processing architecture. You finally managed to deploy and tune the \"ideal\" configuration, but data are like weeds: they just KEEP GROWING! So, eventually you have to add new pieces, or even start over and re-design everything.\r\n\r\nSounds familiar? Cloud can be a solution to this Data Architect nightmare. In this talk we will build an end-to-end Serverless, No-Ops, scalable and reliable data solution, based on Google Cloud Platform.","type":"talk","language":"English","topic":"Architectures","level":"Intermediate","room_order":5,"room":"BL.27.1.2","date":"2016-11-25","starttime":"15:10:00","endtime":"15:50:00"},{"id":4422,"eventid":21,"title":"Human vs Bot: Giocare a Sasso-Carta-Forbici (Lizard-Spock) tra le nuvole","description":"In questa sessione vedremo come realizzare un algoritmo intelligente per giocare a morra cinese (e sue varianti) usando Azure Machine Learning e interagire usando un Bot. In particolare vedremo diverse modalita per predire le mosse dell'avversario rilevando e analizzando pattern da una serie storica e utilizzeremo il nuovo Microsoft Bot Framework e i Cognitive Services per creare un Bot per interagire con l'algoritmo di gioco.","type":"talk","language":"Italian","topic":"AI\/Machine Learning","level":"Beginner","room_order":6,"room":"BL.27.1.5","date":"2016-11-26","starttime":"12:30:00","endtime":"13:10:00"},{"id":4435,"eventid":21,"title":"Conversational power for Android apps","description":"Conversational interfaces are the new cool. During the session we'll see how to add conversational power to any Android app: from listening to the user, understand what she said and provide voice replies. Using internal APIs, external service and a little bit of code","type":"talk","language":"English","topic":"Mobile","level":"Advanced","room_order":0,"room":"BL.27.0.1","date":"2016-11-26","starttime":"12:30:00","endtime":"13:10:00"},{"id":4450,"eventid":21,"title":"Increasing Android app security for free","description":"Secure Development of Android App sometimes requires the use of third party libraries and external frameworks, often expensive or hard to quickly update if vulnerable.The Android SDK and Google Play Services provide security features and services, that allows a developer to take advantage of security enhancements in order to increase the security level of an application.The talk, starting from real common threats, will show how some of these features can be used into the different versions of Android, until the newest Nougat, to mitigate security risks that could afflict a mobile application.","type":"talk","language":"Italian","topic":"Security","level":"Intermediate","room_order":6,"room":"BL.27.1.5","date":"2016-11-26","starttime":"11:30:00","endtime":"12:10:00"},{"id":4473,"eventid":21,"title":"Hololens: primo contatto","description":"Finalmente il device tanto atteso e arrivato, possiamo immergerci nella realta aumentata ed interagire con oggetti e personaggi in maniera naturale ed integrata con la realta circostante.\r\nVediamo come possiamo sviluppare applicazioni per Hololens di quali skill e tecnologie abbiamo bisogno per iniziare.","type":"talk","language":"Italian","topic":"VR\/AR","level":"Beginner","room_order":8,"room":"BL.27.1.4","date":"2016-11-25","starttime":"16:10:00","endtime":"16:50:00"},{"id":4497,"eventid":21,"title":"I am your user. Why do you hate me?","description":"Open source software projects can be prickly toward their users. Poor documentation, a steep learning curve, and a finely tuned focus on excellence and quality can make a project community seem hostile. As a user of many different open source projects over the years, Leslie Hawthorn has often wondered about this problem and contemplated what to do about it. This session takes a long standing private rant with her dear friend and fellow user, Donna Benjamin, public.","type":"keynote","language":"English","topic":"Inspirational","level":"Beginner","room_order":0,"room":"BL.27.0.1","date":"2016-11-26","starttime":"10:30:00","endtime":"11:10:00"},{"id":4508,"eventid":21,"title":"Community Innovation","description":"Building a sustainable startup and contributing to a better world. With tips on community, hiring, and startup culture.","type":"keynote","language":"English","topic":"Inspirational","level":"Beginner","room_order":0,"room":"BL.27.0.1","date":"2016-11-25","starttime":"10:30:00","endtime":"11:10:00"},{"id":4630,"eventid":21,"title":"Universal JavaScript Web Applications with React","description":"Since we started to see JS on the server side, the dream of developers has been to reduce the gap and the cost of switch between frontend\/backend. Today with Node.js, React and a whole ecosystem of tools, this dream is becoming true! In this talk I am going to discuss about Universal (a.k.a. Isomorphic) JS and present some practical example regarding the major patterns related to routing, data retrieval and rendering. I will use Node, React, Webpack, Babel and React Router and give you a series of example to get you started easily with this new technology trend.","type":"talk","language":"English","topic":"Javascript","level":"Intermediate","room_order":1,"room":"BL.27.0.2","date":"2016-11-25","starttime":"16:10:00","endtime":"16:50:00"},{"id":4644,"eventid":21,"title":"Beautiful Authentication: Tear down the barbed wire","description":"People don't ever specifically want to sign in or create an account they just want the features that being signed in allows. Somewhere between upselling and onboarding, they will run into the wall around your beautiful garden, and be forced to sign in if they want to get inside. I'll review the ways you can make sure your gated garden isn't covered in barbed wire. Although this talk is focused on authentication experiences, the ideas apply to many other kinds of features. I use authentication, and in particular my experience with it at SoundCloud, as a case study.","type":"talk","language":"English","topic":"Design\/Frontend","level":"Intermediate","room_order":5,"room":"BL.27.1.2","date":"2016-11-26","starttime":"14:10:00","endtime":"14:50:00"},{"id":4645,"eventid":21,"title":"Coding Culture","description":"A great coding culture gives the power back to the developer and concentrates on making them productive and happy by removing unnecessary overhead, bringing autonomous teams together, helping the individual programmer to innovate, and raising the awareness among developers to create better code.\r\nI will talk about how to establish and foster a strong engineering-focused culture and give lots of examples from our experience at Atlassian to show that once you're working in a great coding culture, you won't want to work anywhere else.","type":"keynote","language":"English","topic":"Inspirational","level":"Beginner","room_order":0,"room":"BL.27.0.1","date":"2016-11-26","starttime":"10:30:00","endtime":"11:10:00"},{"id":4653,"eventid":21,"title":"We started with RoR, C++, C#, nodeJS and... at the end we chose GO","description":"We have a service that can generate million of transactions in short period of time, even few seconds. We started the API backend with RoR on a robust cloud service. We had few customers at the beginning and few transactions. Then, before starting the first big event we made some load test, and we understood that we needed more performance. We have changed the platform many times: servers, languages from RoR, C++, C#, C# mono, to Go. Now, we are still using Go. I will show you the pros and cons in all different scenarios.","type":"talk","language":"English","topic":"Golang","level":"Beginner","room_order":5,"room":"BL.27.1.2","date":"2016-11-26","starttime":"11:30:00","endtime":"12:10:00"},{"id":4654,"eventid":21,"title":"Software Heritage: let's build together the universal archive of our software commons.","description":"Free\/Open Source Software is now everywhere, but the risk of losing forever some of it is growing. Shutdowns of once popular forges are early warnings that we should not underestimate. How many million lines of code would we lose if development hubs that are hype today were to disappear 20 years from now? This talk will present Software Heritage, whose aim is to collect, preserve, and share all publicly available source code. Forever. Software Heritage has already archived 3 billion distinct source code files and 650 million commits, spanning more than 25 million development projects.","type":"talk","language":"English","topic":"Inspirational","level":"Intermediate","room_order":3,"room":"BL.27.0.5","date":"2016-11-26","starttime":"16:20:00","endtime":"17:00:00"},{"id":4680,"eventid":21,"title":"Situational Awareness, Botnet and Malware Detection in the Modern Era","description":"Looking at the modern threat landscape, it is clear that a comprehensive security infrastructure\r\ncannot rely only on traditional automatic systems such as intrusion detection, or anti-virus appliances.\r\nConsidering also that more than 400K new malware are discovered every day, the need for advanced techniques to isolate and identify malware is even more evident.\r\nThis talk will show an overview of modern techniques developed by security researchers and practitioners, the different perspectives and approaches they take and how they evolved to take into account malware evolution.","type":"talk","language":"English","topic":"Security","level":"Intermediate","room_order":6,"room":"BL.27.1.5","date":"2016-11-25","starttime":"17:10:00","endtime":"17:50:00"},{"id":4685,"eventid":21,"title":"Games of Simplicity","description":"10 years after the publication of \"The Laws of Simplicity\", what can we still learn as game designers from John Maeda's seminal work? By drawing on our current experience with our first non-narrative project (local multiplayer \"SIHEYU4N\") and on examples of independent games that best embody Maeda's rules, we'll be looking into the relationship between simplicity and complexity and how video games can creatively tackle such a fascinating issue.","type":"talk","language":"English","topic":"Game Dev","level":"Intermediate","room_order":7,"room":"BL.27.1.4","date":"2016-11-26","starttime":"14:10:00","endtime":"14:50:00"},{"id":4689,"eventid":21,"title":"Cyber Analysts: who they are, what they do, where they are","description":"Cyber security is one of the most challenging topic in the current era. Cyber attacks are becoming day by day more sophisticated and difficult to be detected by automated systems. People who understand cyber threats and act to block cyber attacks are defined as cyber analysts. But what do they really do ? What dificulties do they meet and what background should they have before starting the \"neverending\" \"cyber security\" learning path ? Why is not enough an automated system ?\r\n\r\nMarco will talk about real experiences on the cyber analyst field.","type":"talk","language":"English","topic":"Security","level":"Beginner","room_order":5,"room":"BL.27.1.2","date":"2016-11-26","starttime":"15:10:00","endtime":"15:50:00"},{"id":4726,"eventid":21,"title":"Lo sviluppo di Edge Guardian VR","description":"Cosa significa sviluppare un videogioco in VR partendo da zero?  Cosa e andato dritto e cosa e andato storto durante questi mesi di crunch. Un talk informativo con approfondimenti tecnici dal punto di vista sia del Grafico che del Programmatore.","type":"talk","language":"Italian","topic":"Game Dev","level":"Intermediate","room_order":7,"room":"BL.27.1.4","date":"2016-11-26","starttime":"15:10:00","endtime":"15:50:00"},{"id":4791,"eventid":21,"title":"Creating a microservice style application architecture and running DevOps easily with Mantl.io","description":"We will take an existing 3 tier application (\"vote your favorite superhero\") and transform its architecture into a microservices based application step by step, introducing building blocks like Containers, Proxies, Queues, Caches, etc. and new interfaces (Web, Mobile, Chat, Voice).\r\nAn open source microservices infrastructure platform (Mantl.io) will be used to run the new application in all the stages with the scale needed.","type":"talk","language":"English","topic":"Microservices","level":"Beginner","room_order":4,"room":"BL.27.0.7","date":"2016-11-25","starttime":"14:10:00","endtime":"14:50:00"},{"id":4794,"eventid":21,"title":"From IoT to Human interactions : voice and messages to the rescue (Drone Demo)","description":"What if your surveillance drone could wake you up via a SMS in the middle of the night ?\r\nWhat if an interactive assistant could speak you the next CodeMotion session and give you directions ?\r\nJoin this session to experience how to turn your data into engaging interactions.\r\n\r\nWe'll show case an Innovative Drone demo, and an interactive Voice & Chat assistant for the CodeMotion event, then present the Cisco Spark & Tropo Cloud APIs.\r\n \r\nWant to try these by yourself ? pass by the codelabs where our technical mentors will help you ramp up and build your first Text to Speech and Bot prototypes.","type":"talk","language":"English","topic":"Front-end","level":"Beginner","room_order":4,"room":"BL.27.0.7","date":"2016-11-25","starttime":"11:30:00","endtime":"12:10:00"},{"id":4795,"eventid":21,"title":"How to embed Video Calls and Messaging without being a WebRTC, XMPP or SIP expert","description":"If Messaging and Video communications are now in our habits (whether WhatsApp, Facebook Messenger, Cisco Spark), it is still pretty complicated to integrate these capabilities in our Mobile and Web applications.\r\n \r\nAnnounced at both Apple and Cisco WW conferences in July 2016 (https:\/\/developer.cisco.com\/site\/apple\/), Cisco is working on a SDK that allows developers to add video capabilities to any apps with just a few lines of code.  \r\n\r\nThis SDK is actually in early access by the developer community. You can candidate here if interested : https:\/\/developer.ciscospark.com\/sdkaccess\/","type":"talk","language":"English","topic":"Mobile","level":"Intermediate","room_order":4,"room":"BL.27.0.7","date":"2016-11-26","starttime":"11:30:00","endtime":"12:10:00"},{"id":4824,"eventid":21,"title":"BDD - Bias driven development","description":"Software development is heavily influenced by many of the most common cognitive biases: technical choices are made following hypes (pro-innovation bias) or gurus (bandwagon bias); we create homemade tools instead of using de-facto standards (not-invented-here syndrome) and fix bugs without a full understanding of the problems (placebo bias) or even we pretend that there isn't any problem at all (ostrich bias). The first step to bring software development closer to an engineering discipline is recognizing this biases and admitting that we all suffer of them.","type":"keynote","language":"English","topic":"Inspirational","level":"Beginner","room_order":0,"room":"BL.27.0.1","date":"2016-11-26","starttime":"17:20:00","endtime":"18:00:00"},{"id":4869,"eventid":21,"title":"The hitchhikers guide to UXing without a UXer","description":"Sometimes you are tasked with building great things by yourself or in a small team. Bootstrapped start-ups don't always have the budget for a dedicated Uxer to help you design the best apps, software or websites. \r\n\r\nThis guide will get you started developing the right way and stop you making classic mistakes. Before you even consider touching your dev environment I will show you how to 'Start with one idea', 'Think like a user' and set out your user journeys.","type":"talk","language":"English","topic":"Design\/Frontend","level":"Beginner","room_order":5,"room":"BL.27.1.2","date":"2016-11-25","starttime":"14:10:00","endtime":"14:50:00"},{"id":4890,"eventid":21,"title":"How To Structure Go Applications","description":"For developers used to working with frameworks like Spring, and Rails, Go's\r\nlack of advice on how to structure your application can be bewildering. Many\r\nnew developers, reach for their favourite Spring, or Rails equivalent, and\r\nrely on its structure, but that is a mistake! Go gives us wonderful tools to\r\nput Domain-driven design into practice, and create beautiful applications.","type":"talk","language":"English","topic":"Programming","level":"Beginner","room_order":6,"room":"BL.27.1.5","date":"2016-11-26","starttime":"14:10:00","endtime":"14:50:00"},{"id":4891,"eventid":21,"title":"The Retail Revolution","description":"L'iBeacons e la tecnologia che rivoluzionera la customer experience del settore Retail, per questo la nostra Software LAB di Napoli ha realizzato una piattaforma per la Foundry del principale operatore telefonico del Paese. Durante il technical talk presenteremo una demo e racconteremo le scelte tecnologiche alla base della piattaforma (Dashboard, App Mobile) basata su:  Angular, Cordova, HTML 5 e integrata all'interno del nostro framework d'interoperabilita IoT con approccio Big Data FEEP Iot Platform SOFIA2 (http:\/\/sofia2.com\/home_it.html)","type":"talk","language":"Italian","topic":"Mobile","level":"Intermediate","room_order":5,"room":"BL.27.1.2","date":"2016-11-26","starttime":"12:30:00","endtime":"13:10:00"},{"id":4968,"eventid":21,"title":"Visualizing Concurrency in Go","description":"One of the primary strengths of Go programming language is a built-in first-class support for concurrency. We're going to learn about it in a completely new way, using interactive 3D visualizations, which help us understand the complex but astonishing world of modern concurrent software.  We'll see what's happening inside the real code:from a simple Hello, World' to real production-level high-loaded servers, and learn different approaches and concurrency patterns that are used for building concurrent pipelines and algorithms. And we'll do it all in 3D!","type":"talk","language":"English","topic":"Golang","level":"Beginner","room_order":6,"room":"BL.27.1.5","date":"2016-11-26","starttime":"15:10:00","endtime":"15:50:00"},{"id":4973,"eventid":21,"title":"\"Gridd: Retroenhanced\" - what is behind the scenes?","description":"Talking about the most significant design problems connected to our currently work-in-progress project, \"Gridd: Retroenhanced\", we are going to explain the whys and hows behind our main development choises.\r\nThe talk will lead us to a briefly introduction about our personal method to quickly prototype and test a small game in Unity.","type":"talk","language":"English","topic":"Game Dev","level":"Beginner","room_order":7,"room":"BL.27.1.4","date":"2016-11-26","starttime":"12:30:00","endtime":"13:10:00"},{"id":5094,"eventid":21,"title":"Time to market: when a worse game is better","description":"The experimental Kinect game FRU was released on July 13 on the Xbox One Store. The Verge called it a \"killer app\". Engadget an \"incredible game\", whereas Destructoid gave it a 9.5\/10. It's the highest rated camera-based game ever and yet, it sold less than ten thousand copies.\r\n\r\nAt first glance, the issue might seem obvious: \"It's a Kinect game\". \r\n\r\nHowever, the Kinect 2 peripheral has a respectable install base between 3 and 4 million units, so only the 0,0025 % of the potential target bought the game. What we can learn from this experience?","type":"talk","language":"English","topic":"Game Dev","level":"Intermediate","room_order":7,"room":"BL.27.1.4","date":"2016-11-26","starttime":"11:30:00","endtime":"12:10:00"},{"id":5104,"eventid":21,"title":"Creare Docker da zero con GoLang","description":"Un viaggio alla scoperta di funzionalita che il kernel Linux offre sfruttate da Docker per creare il suo impero e fornire le funzionalita e i benefici ad alto livello. \r\nVedremo live come e facile creare dei CGroups su distro Linux per avere un controllo di un processo, come gestire branches del filesystem, e come dare namespaces per isolare un semplice processo creato da noi. Attenzione verranno mostrati script .sh e un po' di codice in Go.\r\n\r\nFatti un Docker tutto tuo!","type":"talk","language":"Italian","topic":"Golang","level":"Intermediate","room_order":6,"room":"BL.27.1.5","date":"2016-11-25","starttime":"16:10:00","endtime":"16:50:00"},{"id":5113,"eventid":21,"title":"The Evolution Of Asynchronous Javascript","description":"One of JavaScript's strengths is how it handles asynchronous code. Async is one of the most important and often misunderstood part of Javascript or any other language. Async is hard because we, as human beings, can't do two conscious actions at once and think about both of them at the same moment. In this talk we will see how asynchronous JavaScript evolved over the years. It all started with callbacks and it landed on generators","type":"talk","language":"English","topic":"Javascript","level":"Intermediate","room_order":1,"room":"BL.27.0.2","date":"2016-11-26","starttime":"11:30:00","endtime":"12:10:00"},{"id":5123,"eventid":21,"title":"going loopy","description":"An exploration of Go through the lens of a very simple task: iterating through a sequence of values. Starting with the basic C-like semantics of Go's for {} loop construct we'll then build through user defined types, type assertions, closures, channels and reflection to demonstrate generalised concurrent iteration.\r\n\r\nBy the end of the talk we'll have covered all of Go's core language features.\r\n\r\nNo familiarity with Go is required.","type":"talk","language":"English","topic":"Golang","level":"Beginner","room_order":6,"room":"BL.27.1.5","date":"2016-11-25","starttime":"15:10:00","endtime":"15:50:00"},{"id":5131,"eventid":21,"title":"Angular Rebooted: Components Everywhere","description":"Attracted by AngularJS power and simplicity, you have chosen it for your next project. Getting started with DataBinding, Scopes and Controllers was relatively quick and easy. But what do you need to effectively bring a complex application to Production? We discuss the new Component API, from ngOnChanges to selecting different ways for components to collaborate, from choosing between Two-Way Binding and One-Way Data Flow, to \"smart\" vs \"dumb\" components, sharing recipes from our real world experience so that you can productively & reliably build a complex application out of reusable Components.","type":"talk","language":"Italian","topic":"Javascript","level":"Intermediate","room_order":1,"room":"BL.27.0.2","date":"2016-11-25","starttime":"11:30:00","endtime":"12:10:00"},{"id":5142,"eventid":21,"title":"The Most Important Thing","description":"Steve Jobs used to always talk about the \"most important thing,\" what he sometimes called the \"high-order bit,\" the thing we should be working on, and thinking about, to the exclusion of others.\r\n\r\nWhat does it mean? How do we recognize it? Why is it important? What is our \"most important thing,\" and what is the most important \"most important thing\"?\r\n\r\nThis might sound trivial, but it's not. This talk will be inspiring, but it will also be upsetting. Often the most important thing is not what we wish it was, and finding it can be like Armageddon, as your entire future is destroyed.","type":"keynote","language":"English","topic":"Inspirational","level":"Intermediate","room_order":0,"room":"BL.27.0.1","date":"2016-11-25","starttime":"10:30:00","endtime":"11:10:00"},{"id":5150,"eventid":21,"title":"It's All About Developers. Discover Cisco DevNet.","description":"We believe developers come first when it comes to driving innovation. Come learn about Cisco's developer program: DevNet. Join this keynote with Jason Goecke, General Manager at Cisco to discover what you can create, what you can get access to, and more!","type":"keynote","language":"English","topic":"Inspirational","level":"Beginner","room_order":0,"room":"BL.27.0.1","date":"2016-11-25","starttime":"09:40:00","endtime":"10:00:00"},{"id":5160,"eventid":21,"title":"Milano Chatbots Meetup","description":"Milano Chatbots e una community di sviluppatori, imprenditori e designer.\r\n> Il Bot di Codemotion, Emanuele Capparelli\r\nScopriamo insieme quali sono i passi per mettere in produzione il chatbot ufficiale di Codemotion Milano 2016.\r\n> Disegnare la conversazione per Bot Facebook, Vittorio Banfi\r\nDisegnare un bot? Si deve disegnare un bot cosi come si deve disegnare una pagina web. E i colori? E i bottoni? Vi diremo tutto.\r\n> Lead generation in confessionale con i Bot, Adriano Urso\r\nMa se i clienti non facessero domande perche non sanno cosa domandare? Un bot pui guidarli nella direzione giusta?","type":"talk","language":"Italian","topic":"Meetup","level":"Beginner","room_order":5,"room":"BL.27.1.2","date":"2016-11-25","starttime":"18:30:00","endtime":"20:00:00"},{"id":5161,"eventid":21,"title":"Pronti per la legge sulla data protection GDPR? No Panic!","description":"L'Application Economy obbliga l'IT a correre alla stessa velocite del business. Nel contempo l'entrata in vigore di nuove stringenti normative in ambito sicurezza impone l'adeguamento del Software Delivery LifeCycle affinche queste possano essere implementate e testate gia dalle fasi iniziale dello sviluppo, ottimizzando i tempi di delivery e minimizzando il time to market.","type":"talk","language":"Italian","topic":"Security","level":"Intermediate","room_order":6,"room":"BL.27.1.5","date":"2016-11-25","starttime":"12:30:00","endtime":"13:10:00"},{"id":5178,"eventid":21,"title":"Un anno di Front End Meetup! Gioie, dolori e festeggiamenti!","description":"Cos'e successo in un anno di Front End? E cosa succedere nel futuro? Riviviamo insieme l'ultimo anno di novita, gioie e dolori del nostro lavoro. Dalle variabili che invadono il css, al javascript che cerca di aggiustarlo, da flexbox a http2, da nuovi tool a misteriose e nuove figure mistiche.  Un concentrato di tutto cie che vuol dire un anno di Milano Front End Meeup! Non ve l'abbiamo detto? e il nostro compleanno. Oltre ad informarti vieni a conoscere la nostra community, porta le tue idee e vieni ad ascoltare le nostre.","type":"talk","language":"Italian","topic":"Meetup","level":"Beginner","room_order":3,"room":"BL.27.0.5","date":"2016-11-25","starttime":"18:30:00","endtime":"20:00:00"},{"id":5224,"eventid":21,"title":"UGIdotNET Meetup","description":"In questo meetup presenteremo innanzitutto la community UGIdotNET, il primo User Group Italiano .NET, che ha raggiunto i 15 anni di vita. In seguito, ci dedicheremo a 2 sessioni tecniche:\r\n\"The Fine Art of Time Travelling\" (Andrea Saltarello): un'ora per parlare di CQRS ed Event Sourcing evitando di perderci nelle slide e mostrando invece codice.\r\n\"Un \"actor\" (model) per amico\" (Alessandro Melchiori): In questa sessione, dopo una introduzione teorica sull'Actor Model, analizzeremo 2 diverse implementazioni disponibili per l'ecosistema .Net: i Reliable Actors di Azure Service Fabric e Akka.NET","type":"talk","language":"Italian","topic":"Meetup","level":"Advanced","room_order":6,"room":"BL.27.1.5","date":"2016-11-25","starttime":"18:30:00","endtime":"20:30:00"},{"id":5237,"eventid":21,"title":"DevOps in Cloud, dai Container all'approccio Codeless.","description":"Un approccio moderno allo sviluppo software dovrebbe sfruttare linguaggi ed ambienti appartenenti a diverse tipologie di innovazione:  DevOps per automatizzare continuous integration e continuous delivery, il Cloud per gestire il ciclo di vita del software in qualsiasi momento, i Software Containers per raggiungere livelli di scalabilita adeguati alle dimensioni dell'audience e un approccio Codeless per confezionare applicazioni e cruscotti ad uso dell'utenza business. Il talk sara articolato intorno a queste quattro aree mostrando principalmente esempi pratici.","type":"talk","language":"Italian","topic":"DevOps","level":"Intermediate","room_order":4,"room":"BL.27.0.7","date":"2016-11-26","starttime":"12:30:00","endtime":"13:10:00"},{"id":5248,"eventid":21,"title":"Wearable Botnets and Happy Hacked Drivers","description":"Bill Gates prediction has been outdated: Computers are spreading everywhere, and they will be connected and meshed together outdating all current implementation models. But what about security? Talking about hacked ADSL modems, hijacked railways video screens and car's control unit secrets, we'll start to review the real vulnerabilities of this new world, demystifying threats and actors who have already moved in this profitable black-market.","type":"talk","language":"Italian","topic":"Security","level":"Beginner","room_order":3,"room":"BL.27.0.5","date":"2016-11-25","starttime":"15:10:00","endtime":"15:50:00"},{"id":5298,"eventid":21,"title":"Outthink: machines coping with humans. A journey into the cognitive world ","description":"How changed the the Application Development's world from Apollo 11 to 2016? \r\nExceeds the limits of code and allow you app to innovate your business. \r\nIntelligent Machine (Robot), Device which communicate and drone which fly but the core it's always the cognitive development. \r\nCognitive Development: allow you application to solve new issue and innovate your business. \r\nYour application innovates your business outthik code limit. ","type":"keynote","language":"English","topic":"AI\/Machine Learning","level":"Intermediate","room_order":0,"room":"BL.27.0.1","date":"2016-11-25","starttime":"10:00:00","endtime":"10:20:00"},{"id":5351,"eventid":21,"title":"The game design behind Redout","description":"The development of our AG racing game Redout has been quite a ride. Started in 2014, when 34BigThings was still a bunch of friends working in a living room, it has gone through many epiphanies and revolutions before taking its final shape. In this talk I will go through the development stages of the Redout game product: I'll talk about track design and game flow, interface design, vehicle handling, community management, talking to publishers and the press, attending events, observing players play, and how all this influenced the overall design of the game and my own knowledge of game design.","type":"talk","language":"English","topic":"Game Dev","level":"Beginner","room_order":8,"room":"BL.27.1.4","date":"2016-11-25","starttime":"11:30:00","endtime":"12:10:00"},{"id":5352,"eventid":21,"title":"IBM Watson Conversation:  machine learning tools, artificial intelligence capabilities and natural language","description":"Go in deep on this Bluemix Services. Add a natural language interface to your application to automate interactions with your end users. Common applications include virtual agents and chat bots that can integrate and communicate on any channel or device. Train Watson Conversation service through an easy-to-use web application, designed so you can quickly build natural conversation flows between your apps and users, and deploy scalable, cost effective solutions.","type":"talk","language":"Italian","topic":"Cloud\/Bigdata","level":"Beginner","room_order":4,"room":"BL.27.0.7","date":"2016-11-25","starttime":"12:30:00","endtime":"13:10:00"},{"id":5360,"eventid":21,"title":"Bud Spencer & Terence Hill - Slaps And Beans.  Dalla demo a Kickstarter","description":"Storia del progetto Slaps and Beans (Schiaffi&Fagioli), dalla Spaghetti Western Jam di Indievault, passando per la ricerca dell'ufficialita fino alla campagna Kickstarter.\r\nStruttura del gioco, Game design e futura organizzazione del team di sviluppo.","type":"talk","language":"Italian","topic":"Game Dev","level":"Beginner","room_order":8,"room":"BL.27.1.4","date":"2016-11-25","starttime":"14:10:00","endtime":"14:50:00"},{"id":5382,"eventid":21,"title":"Learn to build Bots, and add Video, SMS, Voice to your apps by using Cisco Spark and Tropo","description":"In this lab you will definitely get in touch with the new Cisco capabilities provided by Spark and Tropo services.\r\nIf you are working on an app and you wish to boost the communication capabilities, don&rsquo;t miss these labs!\r\nJoin us in the Cisco Area and choose your hands-on lab! Meet Cisco specialists who will help you in discovering all the functionalities of Cisco Spark and Tropo and actually help you to integrate them in your app easily.\r\nThe codelabs hands-on will run throughout the first day of Codemotion Milan, from 11 am to 6 pm: come and say hello at any time.","type":"lab","language":"English","topic":"AI\/Machine Learning","level":"Beginner","room_order":11,"room":"BL.27.0.6","date":"2016-11-25","starttime":"11:30:00","endtime":"18:00:00"},{"id":5383,"eventid":21,"title":"Cutting Edge Development with Google code lab hands-on!","description":"Google Codelabs for developers staying on the cutting edge!\r\nJoin us in the Google Area anche choose your hands-on coding experience with Google experts!\r\nYou will have the opportunity to choose among 50 different sessions, always available!\r\nJoin us whenever you please: the codelab will run throughout both the days of the conference, all day long.\r\nWith them, you will be able to create a step-by-step applications, or add functionalities to boost your existing ones.\r\nThis Codelab stands for an incredible opportunity to deepen your knowledge of each technology and learn the full potential!","type":"lab","language":"English","topic":"Back end","level":"Intermediate","room_order":10,"room":"BL.27.1.3","date":"2016-11-25","starttime":"11:30:00","endtime":"17:30:00"},{"id":5384,"eventid":21,"title":"From zero to VR!","description":"Virtual Reality is growing to be the Next Big Thing in multimedia entertainment and education.\r\nIn this workshop we will build an interactive scene for mobile VR, starting from scratch and using Unity3D with the Google VR SDK.\r\nThe complete Unity3D project will be provided to all the participants.","type":"lab","language":"Italian","topic":"VR\/AR","level":"Intermediate","room_order":9,"room":"BL.27.1.8","date":"2016-11-25","starttime":"16:10:00","endtime":"17:50:00"},{"id":5385,"eventid":21,"title":"Master the chaos: from raw data to analytics","description":"Nowadays we are drowning in data but starving for knowledge&hellip; Experience the challenging task of exploiting apparently unrelated data to address your information needs.\r\nDuring the lab we will rely on the ELK stack to build up a state-of-the-art framework for data processing and visualization.","type":"lab","language":"Italian","topic":"Cloud\/Bigdata","level":"Beginner","room_order":8,"room":"BL.27.1.8","date":"2016-11-26","starttime":"11:30:00","endtime":"13:10:00"},{"id":5386,"eventid":21,"title":"Bot Revolution Lab","description":"Do you want to learn how to create a bot that works with the most known platforms like Telegram, Facebook Messenger and Skype making it context aware and capable of translating human language into actions?\r\nSamples will be provided in NodeJS.","type":"lab","language":"Italian","topic":"AI\/Machine Learning","level":"Intermediate","room_order":9,"room":"BL.27.1.8","date":"2016-11-25","starttime":"11:30:00","endtime":"13:10:00"},{"id":5387,"eventid":21,"title":"Swift 3 Playgrounds","description":"Swift is a powerful and intuitive programming language for macOS, iOS, watchOS and tvOS. Swift 3.0 it the first major release since it was open-sourced. The syntax is concise yet expressive, and it includes modern features developers love. In this code lab, you&rsquo;ll learn to write Swift through Playground; Playground is a tool that instantly shows the results of the code that you write. Come and see how is fun and interactive writing app with Swift.","type":"lab","language":"Italian","topic":"Languages","level":"Beginner","room_order":9,"room":"BL.27.1.8","date":"2016-11-25","starttime":"14:10:00","endtime":"15:50:00"}],"speakers":[{"id":48,"name":"Aurelio","surname":"De Rosa","biography":"I'm a (full-stack) senior web developer, working at Digital Detox, with more than 5 years' professional experience programming for the web using the WAMP stack and HTML5, CSS3, Sass, JavaScript, and PHP. I'm a member of the jQuery team and the JoindIn team, and an expert of JavaScript and HTML5 APIs. My interests also include web security, accessibility, performance, and SEO. I'm a also a regular writer, speaker, author of books, and co-author of some academic papers.","role":"Lead developer","company":"Digital Detox","community":"","website":"https:\/\/www.audero.it","github":"https:\/\/github.com\/AurelioDeRosa","twitter":"@AurelioDeRosa","facebook":""},{"id":57,"name":"Matteo","surname":"Vaccari","biography":"Sono appassionato di sviluppo software da sempre. Ho lavorato come sviluppatore individuale per molti anni per poi rendermi conto che non ero in grado di collaborare in maniera efficace con gli altri sviluppatori.\n\nHo sentito parlare di Extreme Programming (XP) dal 2000, ma e stato solo nel 2004 che qualcosa ha fatto \"clic\" e da allora sono fortemente convinto che non ci sia un metodo di sviluppo piu efficace.\n\nLavoro come consulente, trainer e coach.","role":"Developer","company":"ThoughtWorks","community":"Agile","website":"http:\/\/matteo.vaccari.name\/","github":"https:\/\/github.com\/xpmatteo\/","twitter":"@xpmatteo","facebook":""},{"id":68,"name":"Francesco","surname":"Fullone","biography":"I love to work with web technologies and my new hobby is testing startups business models. You can find me in almost every social networks as fullo and physically, sometimes, in ideato's office in Cesena.\r\n\r\nI spend some of his free time traveling, organising conferences (like Kerning, BetterSoftware, phpDay and jsDay) for GrUSP, one of the biggest European community on PHP, and writing books. If you attended any international (or national) conference about web technologies in Italy, you met me as speaker, organiser or attendee.","role":"CEO","company":"ideato","community":"grusp","website":"http:\/\/fullo.net","github":"http:\/\/github.com\/fullo","twitter":"@fullo","facebook":"http:\/\/fb.com\/francesco.fullone"},{"id":140,"name":"Massimo","surname":"Oliviero","biography":"Massimo Oliviero e uno sviluppatore iOS e OS X con il pallino della musica e della fotografia. Si occupa di sviluppo software, consulenza e formazione dal 1999.","role":"Software Developer","company":"Freelance","community":"#pragma mark","website":"http:\/\/www.massimooliviero.net","github":"https:\/\/github.com\/maxoly\/","twitter":"@maxoly","facebook":""},{"id":141,"name":"Luigi","surname":"Dell Aquila","biography":"Computer engineer, Open Source enthusiast, technology addicted.\r\nDirector of Consulting and Core Developer at OrientDB.","role":"Director of Consulting and Core Developer","company":"OrientDB LTD","community":"Raspberry Jam Roma","website":"","github":"github.com\/luigidellaquila\/","twitter":"@ldellaquila","facebook":""},{"id":168,"name":"Giulio","surname":"De Donato","biography":"Liuggio aka Giulio De Donato is a passionate open source developer, he is the Docker Advocate at XPeppers. Expert in e-commerce platforms and Service Oriented Architecture, he is actively involved in the PHP community and Golang ecosystem. An open source library he created is currently used by wikipedia and the composer badges are used by all the PHP github repositories. He is known as evangelist of good design, code quality and Dev-Ops methodologies.","role":"Docker Advocate","company":"XPeppers","community":"symfony, pug roma, rome js, golang","website":"http:\/\/welcometothebundle.com","github":"http:\/\/github.com\/liuggio","twitter":"@liuggio","facebook":""},{"id":173,"name":"Marco","surname":"Dal Pino","biography":"Marco works in IT for over 20 years, as a freelance consultant he has worked with dozens of companies to develop LOB applications in many different industries. He has extensive experience in the enterprise and industry mobile devices. He worked on the development of industrial devices based on Windows Embedded platforms. Recently he has approached the world of IoT for developing distributed sensor and robotics systems. He often host development courses for Windows platforms, Embedded and IoT courses. He is involved in the activities of technological communities in Italy and Europe, carries ou","role":"SW Engineer","company":"DPCons","community":"DotNetToscana, DotNetLombardia, DomusDotNet","website":"http:\/\/www.mobileprog.com","github":"","twitter":"@marcodalpino","facebook":"https:\/\/www.facebook.com\/marcodalpino"},{"id":185,"name":"Waehner","surname":"Kai","biography":"Kai Waehner works as Technology Evangelist at TIBCO. His main area of expertise lies within the fields of Application Integration, Big Data, Analytics, SOA, BPM, Cloud Computing, Java EE and Enterprise Architecture Management. Kai is speaker at international IT conferences such as JavaOne, ApacheCon or OOP, writes articles for professional journals, and shares his experiences with new technologies on his blog (www.kai-waehner.de\/blog).\r\nContact: kontakt@kai-waehner.de. Twitter: @KaiWaehner. Find more details and references (presentations, articles, blog posts) on his website www.kai-waehner.de","role":"Technology Evangelist","company":"TIBCO","community":"Java User Group Munich, Hadoop User Group Munich, Microservices Meetup Munich, Big Data Beers Berlin","website":"http:\/\/www.kai-waehner.de","github":"","twitter":"@KaiWaehner","facebook":""},{"id":190,"name":"Andrea","surname":"Pompili","biography":"Andrea Pompili is an information technology specialist that takes care of security. Quite young, he joined the computer's world with one of the most famous Italian games based on the C64 platform. Once graduated, he started working first in the software development market, and then in computer security, following security threats and solutions on strategic projects. \r\nCurrently Andrea is a strategy advisor in security, and aims to discover and integrate innovative solutions for this connected world. Starting from 2013 he has joined the OWASP ZAP developement core team.","role":"Security Consultant","company":"Independent","community":"OWASP ZAP","website":"http:\/\/letigriditelecom.blogspot.it\/","github":"","twitter":"","facebook":""},{"id":226,"name":"Nikolas","surname":"Martens","biography":"Nikolas Martens is a full-hearted freelancing software engineer and trainer in Berlin. He has been coding on various platforms including desktop applications, embedded systems and robots, but is most experienced in web development. His interests are software architecture, automated testing, web applications, distributed system, lean methods, and specification by example. In his spare time he develops experimental frameworks or simply enjoys Berlin's city life. You can find Nikolas on rtens.org.","role":"Software Engineer","company":"Freelancer","community":"PHP Berlin, Agile Developers Berlin","website":"http:\/\/rtens.org","github":"http:\/\/github.com\/rtens","twitter":"@rtens_","facebook":""},{"id":266,"name":"Giovanni","surname":"Laquidara","biography":"Senior Software Engineer @ Snapback, previously Software Engineer working in Air Traffic Control and Command & Control System development field. Active member in GDG-Rome and CodeInvaders Communities having fun developing Android and Web Application. Startupper in love with new and life changing technologies. Work Hard Dance Hard ;)","role":"Senior Software Engineer","company":"Snapback","community":"Google Developers Group Rome, CodeInvaders, VR Dev Rome","website":"www.laquysoft.com","github":"https:\/\/github.com\/joaobiriba","twitter":"@joaolaq","facebook":""},{"id":282,"name":"Francesco","surname":"Novelli","biography":"I'm 23 years old software developer. I've started working with PHP following the programming passion and I've improved my skills during the years. I also start to developing for iOS when the SDK came out and some years later I wrote a book about iOS app developing and this year I wrote also a book about OS X programming.\r\nActually I work as freelance and I develop web app using PHP (I use Yii framework) and iOS Apps. \r\nSpeaker at Codemotion 2013 and PragmaConference 2013.","role":"Mobile Developer","company":"Blinkar","community":"pragmamark","website":"9lli.it\/francesco","github":"https:\/\/github.com\/F9","twitter":"@if9","facebook":"https:\/\/www.facebook.com\/fnove"},{"id":303,"name":"Roberto","surname":"Gassira","biography":"Senior security analyst and Android mobile developer for the Mobile Security Lab of Consulthink S.p.A., Roberto Gassira is specialized in Information Security with an indepth focus on the Mobile World. He works on reverse engineering, vulnerability assessment and secure development of Android applications.\r\nHe has spoken at international conferences such as Blackhat, DeepSec and DroidCon.","role":"Senior Security Analyst","company":"Consulthink S.p.A.","community":"GDG L-Ab","website":"","github":"","twitter":"@robgas","facebook":""},{"id":310,"name":"Mario","surname":"Cartia","biography":"I was born in Siracusa 37 years ago. When I was 8 years old started learning computer programming by myself on my Commodore 64. I studied Computer Science at University of Catania and achieved a diploma of specialization in \"Computer security and digital forensic\" at the University of Teramo. I'm a Red Hat Certified Professional too. I was founder and board member of several community (JUG, LUG). Actually employed as CTO at Argo Software, leading company in Italy in the software industry for the school of any level.","role":"CTO","company":"Argo Software","community":"JUG Sicilia, LUG Siracusa","website":"http:\/\/www.argosoft.it","github":"","twitter":"https:\/\/twitter.com\/mariocartia","facebook":""},{"id":327,"name":"Antimo","surname":"Musone","biography":"Co-founder di Fifth Ingenium e IT Manager \/ Architect presso Ernst & Young , mi occupo dello Sviluppo, Design e del Delivery di diversi progetti per svariati settori di business ( pubblico, bancario, trasporti, comunicazioni ). Sono un ingegnere informatico della II universita di Napoli, vincitore del concorso internazionale Imagine Cup 2012, Co-Founder del progetto  FifthElement, da anni lavoro nell'ambito IT Enterprise dove ho acquisito la conoscenza di svariate tecnologie, in particolare Cloud & Web. Il mio tempo libero lo dedico ai viaggi e alla scoperta di nuove trend tecnologici.","role":"IT Manager \/ Architect","company":"Ernest & Young","community":"Microsoft Student Partner","website":"#","github":"","twitter":"@AntimoMusone","facebook":"https:\/\/it-it.facebook.com\/antimo.musone"},{"id":332,"name":"Emanuele","surname":"Di Saverio","biography":"The innovative drive and the turbulence that are currently storming the Mobile development industry are a great chance to apply and leverage Agile and Lean methods.\r\nAgile Coach and Mobile Architect, disruptive thinker and trainer. Proven track of sparking, fostering and steering Agile transitions in SMBs. Empathic and modern leadership skills.","role":"Principal Design Technologist","company":"frog","community":"","website":"","github":"https:\/\/github.com\/hazam","twitter":"@hazam","facebook":""},{"id":342,"name":"Tiffany","surname":"Conroy","biography":"Tiffany is a Canadian living in Berlin. She is a senior product manager and engineer at SoundCloud. Her specialty is picking apart nuanced user needs and translating them into nitty gritty technical requirements. She gives talks at the intersection of UX and dev. She has been co-curator of JSConf EU since 2012, and currently co-organizes Berlin.JS.","role":"Product Manager & Engineer","company":"SoundCloud","community":"","website":"http:\/\/tif.ca","github":"https:\/\/github.com\/theophani","twitter":"@theophani","facebook":""},{"id":359,"name":"Matteo","surname":"Valoriani","biography":"Matteo Valoriani obtained the Master of Science cum Laude in Computer Engineering at Politecnico di Milano in 2011. He worked for two years at Microsoft Italy, but in 2012 he decided to follow his passion for technology and innovation and started a PhD in Computer Science. His research activity focuses on new unconventional technologies and paradigms for ambient interaction, as well as voice commands, touch and touchless gestures, proxemic Interactions. Matteo is Microsoft MVP for Kinect and Intel Software Innovator for RealSense. In 2014, he founded FifthIngeniun, focused on IT innovation.","role":"CEO","company":"FifthIngeniunm","community":"DotNetLombardia, MVP, MSP","website":"http:\/\/www.fifthingenium.com\/","github":"https:\/\/github.com\/mvaloriani","twitter":"@MatteoValoriani","facebook":""},{"id":385,"name":"Carlo","surname":"Bonamico","biography":"Carlo's passion for Software began with a C128, then grew with Linux, Java\/JavaScript, web & enterprise apps, and now cloud & security. After a PhD and research experience at the University of Genova and the CNIT National TLC Research Consortium, and an exciting time at startup Eptamedia, he's now a Solution Architect and Senior Trainer at NIS s.r.l.. His personal communication style as an architect and trainer, both technically precise and able to present in an engaging way complex topics to an heterogeneous audience has been appreciated online and at many events from Devoxx to Codemotion.","role":"Solution Architect","company":"NIS s.r.l.","community":"JUG Genova","website":"http:\/\/www.carlobonamico.com","github":"https:\/\/github.com\/carlobonamico","twitter":"@carlobonamico","facebook":""},{"id":391,"name":"Alfredo","surname":"Morresi","biography":"79ers, nature and technology lover, supporter of open-source philosophy and footings along the beach. Maieutic and social oriented, passionate about evolutions of mobile world. Best dishes: community, code and Tiramisu'. Desires? A couple of additional hours of sleep every day.","role":"Developer Relations","company":"Google","community":"","website":"http:\/\/www.rainbowbreeze.it","github":"","twitter":"@rainbowbreeze","facebook":"https:\/\/www.facebook.com\/alfredo.morresi"},{"id":404,"name":"Lorenzo","surname":"Barbieri","biography":"Lorenzo Barbieri aka @_geniodelmale (evil genius) is a Microsoft Sr. Technical Evangelist specialized in Windows desktop, tablet and mobile development. He's also working with cloud technologies like Azure and Office365 and he likes to engage with communities, people, especially if there is great food!","role":"Sr. Technical Evangelist","company":"Microsoft","community":"UgiDotNet, DotNetLombardia, DomusDotNet, DotDotNet, XeDotNet, DotNetMarche, DotNetToscana, DotNetLiguria, DotNetSide, OrangeDotNet, DotNetCampania","website":"http:\/\/www.geniodelmale.info","github":"","twitter":"@_geniodelmale","facebook":""},{"id":470,"name":"Alessandro","surname":"Cinelli","biography":"Alessandro Cinelli (a.k.a. cirpo) is currently working at Sainsbury's in London as Lead developer. He loves to share and give back to the community, that's why he actively contributes to open source projects and when he was in Italy he has been a board member of the Italian PHP, Javascript User Group and WEBdeBS.","role":"Lead Developer","company":"Sainsbury's","community":"WEBdeBS, GrUSP, WEBdeLDN","website":"","github":"https:\/\/github.com\/cirpo","twitter":"@cirpo","facebook":""},{"id":480,"name":"Andrea","surname":"Saltarello","biography":"Andrea is solution architect and consultant @ Managed Designs, focusing on architecture and methodology topics.\r\nAs a trainer and speaker, he had several speaking engagements for events and conferences both in Italy and abroad: he is co-author of 'MS .NET: Architecting Applications for the Enterprise by Microsoft Press. \r\nIn 2001 he co-founded UGIdotNET, the first Italian .NET User Group, of whom he is the President and leader. \r\nAndrea is passionate about sports and music, being devoted to Depeche Mode, which he fell in love with since listening to Everything Counts for the first time.","role":"CEO","company":"Managed Designs S.r.l.","community":"UGIdotNET, GUISA","website":"http:\/\/www.manageddesigns.it","github":"https:\/\/github.com\/andysal","twitter":"@andysal74","facebook":"https:\/\/www.facebook.com\/andysal"},{"id":485,"name":"Mario","surname":"Fusco","biography":"Mario is a senior software engineer at Red Hat working at the development of the core of Drools, the JBoss rule engine. He has a huge experience as Java developer having been involved in (and often leading) many enterprise level projects in several industries ranging from media companies to the financial sector. Among his interests there are also functional programming and Domain Specific Languages. He is also the co-author of \"Java 8 in Action\" published by Manning.","role":"Software Engineer","company":"Red Hat","community":"JUG Milano","website":"","github":"https:\/\/github.com\/mariofusco\/","twitter":"@mariofusco","facebook":""},{"id":525,"name":"Giorgio","surname":"Natili","biography":"On paper, Giorgio Natili is an engineering lead at McGraw-Hill Education where he spearheads the accessibility and mobile\/reading experience initiatives for the company's LearnSmart division. On the job, Giorgio is a strong proponent of agile development practices whose passion for usable, testable and maintainable code is only surpassed by his determination to make things work. In addition to standards-based application development, Giorgio's areas of expertise include real-time communication and surfing off the coast of his native Italy.","role":"Lead Mobile Engineer","company":"McGraw Hill Education","community":"CodeInvaders","website":"","github":"","twitter":"https:\/\/www.twitter.com\/giorgionatili","facebook":""},{"id":578,"name":"Paolo","surname":"Perego","biography":"After some time spent doing penetration test, Paolo is now focused on security code reviews, secure software design and working on patches to handle exposures found.\r\n\r\nHe loves writing web application using Ruby and Sinatra framework, applying TDD and BDD with secure bonding principles. Paolo so becomes an application security specialist helping developers in writing secure code by breaking into it.\r\n\r\nHe wrote Dawnscanner (https:\/\/dawnscanner.org), a static analysis tool fo ruby written applications and he blogs at https:\/\/codiceinsicuro.it and https:\/\/armoredcode.com.","role":"technical blogger","company":"codiceinsicuro.it","community":"Owasp, Ruby Italy","website":"https:\/\/codiceinsicuro.it","github":"https:\/\/github.com\/thesp0nge","twitter":"@thesp0nge","facebook":"https:\/\/www.facebook.com\/codiceinsicuro"},{"id":599,"name":"Maurizio","surname":"Mangione","biography":"Maurizio, better known as Granze on the internet, has always been fascinated by computers: his first love was a Commodore 64.\r\n\r\nHe's never afraid to try the \"new thing\" and use it as soon as he can, for this reason, he fell in love with the idea of Web Components and has been using Polymer since the very beginning.\r\n\r\nMaurizio is a Google Developers Expert for web technologies with the specialization on Polymer.\r\n\r\nHe founded Milano JS, probably the most influential Javascript community in Italy and JS Girls, an international event to promote girls participation in the programming world.","role":"Founder","company":"Milano JS","community":"Milano JS","website":"http:\/\/granze.net","github":"https:\/\/github.com\/Granze","twitter":"@granze","facebook":"http:\/\/facebook.com\/granze"},{"id":603,"name":"Sven","surname":"Peters","biography":"Sven Peters is a software geek working as an Evangelist for Atlassian. He started with Java development in 1998 and has been programming for longer that he'd like to admit. Besides coding his passion is effective software development, keeping developers motivated, and helping them kick-ass. Sven has extensive speaking experience in 20+ countries on myriad topics.","role":"Evangelist","company":"Atlassian","community":"","website":"http:\/\/www.svenpet.com","github":"","twitter":"@svenpet","facebook":""},{"id":636,"name":"Andrea","surname":"Maietta","biography":"Passionate advocate of agile methods, Andrea helps companies to identify opportunities, analyze business cases and innovate their processes accordingly to build value.\r\nAlways excited to learn and share, in his \"spare\" time he is a frequent speaker at conferences and is involved in training, communication and organization. He's an editor for the \"Made for Makers\" series, where he also writes books for makers.","role":"Business Innovation Agent","company":"GPA Wide Group","community":"frankenstein garage","website":"www.gpawidegroup.com","github":"https:\/\/github.com\/andreamoz","twitter":"andreamaietta","facebook":"https:\/\/www.facebook.com\/andrea.moz.maietta"},{"id":693,"name":"DuyHai","surname":"Doan","biography":"Duy Hai is working for Datastax as Cassandra Technical Advocate. He spends his time\r\nbetween technical presentations\/meetups on Cassandra, coding on open\r\nsource projects to support the community and helping all companies\r\nusing Cassandra to make their project successful. Previously he was\r\nworking as a freelance Java\/Cassandra consultant.","role":"Technical Advocate","company":"Datastax","community":"Cassandra","website":"","github":"http:\/\/www.github.com\/doanduyhai","twitter":"@doanduyhai","facebook":""},{"id":729,"name":"Roberto","surname":"Lupi","biography":"Roberto has been a Google SRE for 4 years, working on production monitoring and machine learning. Prior to Google, he worked for 14 years in software and systems engineering leading web, virtual reality and health care projects for small and large enterprises, startups and more than 20 banks.","role":"Site Reliability Engineer","company":"Google","community":"","website":"","github":"","twitter":"@robertolupi","facebook":""},{"id":735,"name":"Matteo","surname":"Pozzi","biography":"Along with visual designer Claudia Molinari, creative writer Matteo Pozzi is one half of We Are Muesli, an Italian independent duo based in Milan, Italy. Since 2010, Claudia and Matteo have been working together on cultural experiments of unconventional storytelling in diverse fields of design and communication, ranging from printed to digital projects. In 2013, WAM took their first step into game design with the award-winning visual novel series \"CAVE! CAVE! DEUS VIDET.\".","role":"Game Designer & Writer","company":"We Are Mesli","community":"","website":"http:\/\/www.wearemuesli.it\/","github":"","twitter":"@writer_arbeiter","facebook":"https:\/\/www.facebook.com\/wearemuesli"},{"id":737,"name":"Claudia","surname":"Molinari","biography":"Along with creative writer Matteo Pozzi, visual designer Claudia Molinari is one half of We Are Muesli, an Italian independent duo based in Milan, Italy. Since 2010, Claudia and Matteo have been working together on cultural experiments of unconventional storytelling in diverse fields of design and communication, ranging from printed to digital projects. In 2013, WAM took their first step into game design with the award-winning visual novel series \"CAVE! CAVE! DEUS VIDET.\".","role":"Game & Visual Designer","company":"We Are Muesli","community":"","website":"http:\/\/www.wearemuesli.it\/","github":"","twitter":"@sweetnevermind","facebook":"https:\/\/www.facebook.com\/claudia.molinari1"},{"id":798,"name":"Vito Flavio","surname":"Lorusso","biography":"Cloud Evangelist in Microsoft. Working on Azure since its early days and working with partners in EMEA as a tech advisor. In Microsoft since 9 years, has had lots of experience in Web end Enterprise development. Now enjoying the freedom and challenges of the disruptive Cloud and things world","role":"Senior Technical Evangelist","company":"Microsoft","community":"UgiDotNet","website":"http:\/\/blogs.msdn.com\/b\/vitolo\/","github":"","twitter":"@vflorusso","facebook":""},{"id":816,"name":"Boris","surname":"Dinkevich","biography":"Co-Founder  500Tech - React & AngularJS consulting services. Founder of the Israeli Angular and React meetups, teacher of React & Redux and co-author of The Redux Book.","role":"CoFounder","company":"500Tech","community":"","website":"http:\/\/500Tech.com","github":"","twitter":"BorisDinkevich","facebook":""},{"id":889,"name":"Elisabetta","surname":"Rinaldi","biography":"Manager at IBM, Italy, since 2007, and since I joined this company in 1999, I covered several technical roles. \r\nPeople are my main motivation today, nothing is achievable without them. My manager tells me that my enthusiasm is contagious, and I'm convinced people and teams I'm working with can get benefits from there, especially dealing with crises or with big challenges. Now I'm working @RomeLab as  Security and Compliance Manager - Bluemix Platform\r\nIBM Cloud","role":"Security & Compliance Manager - Bluemix","company":"IBM","community":"https:\/\/www.facebook.com\/groups\/ibmbluemixitalia","website":"www.ibm.com\/it","github":"https:\/\/github.com\/l2fprod","twitter":"@eli_rinaldi","facebook":""},{"id":982,"name":"Enrico","surname":"Zimuel","biography":"I'm a Software Engineer since 1996. I work in the R&D department of Zend, a Rogue Wave Company (USA). I'm a core developer of the open source projects Zend Framework and Apigility. I'm a TEDx and regular speaker of international PHP conferences. I did computer science research at the Informatics Institute of the University of Amsterdam. I'm the co-author of the italian books PHP Best Practices and Javascript Best Pracitces published by FAG Milano.  I'm the co-founder of PHP User Group in Turin (Italy), where I live and work remotely.","role":"Senior Software Engineer","company":"Zend Technologies","community":"PHP User Group Torino, GrUSP","website":"http:\/\/www.zimuel.it","github":"https:\/\/github.com\/ezimuel","twitter":"@ezimuel","facebook":""},{"id":993,"name":"Luca","surname":"Mezzalira","biography":"I'm an Italian Solutions Architect with 13 years of experience, a Google Developer Expert on Web Technologies and manager of London Javascript community (www.londonjs.uk)\r\nI had the chance to work in cutting edge projects for mobile (iOS, Android, Blackberry), desktop, web, TVs, set top boxes and embedded devices.\r\nI think the best way to use any programming language is mastering their models, that's why I spent a lot of time studying and researching on topics like OOP, Functional programming and Reactive programming.","role":"Solutions Architect","company":"Perform Group","community":"London Javascript Community, Google Developer Experts","website":"http:\/\/lucamezzalira.com","github":"https:\/\/github.com\/lucamezzalira\/","twitter":"@lucamezzalira","facebook":"https:\/\/www.facebook.com\/luca.mezzalira.75"},{"id":1086,"name":"Bruno","surname":"Bossola","biography":"Bruno starts coding in LM on a Vic20, then working in C since 1988, in Java since 1996. He developed distributed objects and large scale application for the enterprise using RMI, CORBA and J2EE. In 1999 he coaches one of the first group that adopts XP method in Italy. In 2002 he has co-founder of Java User Group Torino, in 2005 he's recognized as Java Champion, He has been promoting Java technologies as a speaker in Italy at developer conferences like Webbit, AgileDay, JavaConference, Javaday and in Europe at Devoxx, Jazoon and Geecon. Now he settled in London and enjoys the weather :)","role":"VP of Engineering","company":"JUG Torino","community":"JUG Torino, Java Champions","website":"http:\/\/about.me\/bbossola","github":"https:\/\/github.com\/bbossola","twitter":"@bbossola","facebook":"https:\/\/www.facebook.com\/bruno.bossola"},{"id":1121,"name":"Gabriele","surname":"Provinciali","biography":"Gabriele Provinciali is a Digital Architect in Oracle Italia, and currently working as Technology Advisor in Oracle enterprise accounts, with a specialization on Service Oriented Architectures, Mobile Computing, User Interaction technologies (Portals) and Big Data technologies. Provinciali has a long and proficient experience in the Telco Sector (Ericsson, British Telecom, and Marconi Communications) and in the Information Technology area (Sun, EMC, Silverstream, IONA, BEA, CA, Oracle), focused on the architecture, design and implementation of enterprise software solutions.","role":"Digital Architect","company":"Oracle","community":"","website":"www.provinciali.com","github":"","twitter":"@GabbaPro","facebook":""},{"id":1139,"name":"Roberto","surname":"Piccirillo","biography":"Senior Security Analyst for Mobile Security Lab of Consulthink S.p.A.. He graduated in Computer Science and specialises in Information Security. He deals mainly with Mobile Applications, Protocol Security and vulnerability assessment on Web and Mobile applications but he works also on reverse engineering and on secure development of Android applications. He partecipated as speaker at Security Conferences such as BlackHat, DeepSec and Droidcon UK 2014","role":"Senior Security Analyst","company":"Consulthink S.p.A.","community":"","website":"","github":"","twitter":"@robpicone","facebook":""},{"id":1146,"name":"Matteo","surname":"Pagani","biography":"I'm a developer with a strong passion about mobile development and, especially, the Windows and Windows Phone platforms. A passion that I love to share with the communities as a blogger, book writer and speaker in many national and international conferences. I'm one of the founders of the community DotNetLombardia, I've been a Microsoft MVP and a Nokia Developer Champion for almost 5 years, until in November 2014 I joined Microsoft as a Windows AppConsult Engineer, with the goal of supporting Windows developers all around the world.","role":"Windows AppConsult Engineer","company":"Microsoft","community":"DotNetLombardia","website":"http:\/\/wp.qmatteoq.com","github":"http:\/\/github.com\/qmatteoq","twitter":"@qmatteoq.","facebook":""},{"id":1148,"name":"Sonia","surname":"Pini","biography":"Sonia Pini, (born March 25, 1976)  is owner of Pini Solutions since 2008. In 2003 she took the degree in Computer Science at the University of Genova with a dissertation on 'Ubiquity and automation role in modern hospital'. In 2007 she received a PhD in Computer Science at the University of Genova with a dissertation on 'Blueprint: A High-Level Pattern Based AOP Language'.","role":"Developer","company":"Nis","community":"","website":"","github":"","twitter":"@sonietta","facebook":""},{"id":1178,"name":"Marco","surname":"Giammetti","biography":"Illustrator, cartoonist, web developer and game designer. More than 20 years of experiences as web designer, creator of many Videogame online content from 98.\r\n\r\nIn 2004 creates Beavers.it, one of the first webcomic on the videogame industry in Italy. 2007 is the first year of his collaboration with the web agency Neikos, where he soon became the Lead Designer of all the team. He is often invited as speaker to conference and workshop to talk about his experience as comic authors and game developer. Actually working for his own games. Loves VR.","role":"Co-Founder","company":"Hypothermic Games","community":"","website":"www.beavers.it","github":"","twitter":"@thetmo","facebook":"https:\/\/www.facebook.com\/theTMO"},{"id":1336,"name":"Zan","surname":"Markan","biography":"I work on all things mobile at Pusher in London, helping developers to build highly connected apps.\r\nMy favourite topics are software architecture and testing, and also the current developments in the world of EU\/US policy, things that affect the lives of developers (and users) in different ways","role":"Lead Mobile Engineer","company":"Pusher","community":"London software craftsmanship community, London android meetup, London Java community","website":"http:\/\/www.spacecowboyrocketcompany.com\/","github":"https:\/\/github.com\/zmarkan","twitter":"@zmarkan","facebook":""},{"id":1530,"name":"Michele","surname":"Orsi","biography":"I am a software engineer that is really passionated about the job and is continuously working and studying to improve skills and knowledge.\r\nI founded a company with 2 friends that was sold this year in February 2015 to lastminute.com group.\r\nBefore I was in Germany at European Space Agency, where I helped brilliant guys to flight satellites.\r\n\r\nAt the moment I am in London as a Software Architect in lastminute.com group.","role":"Software architect","company":"lastminute.com group","community":"XPUG Milano","website":"","github":"https:\/\/github.com\/micheleorsi","twitter":"@micheleorsi","facebook":""},{"id":1611,"name":"Domenico","surname":"Maracci","biography":"A background as System Integration Consultant and Solution Architect, covering all the application delivery process, from the development stage to the test and roll-out in production of innovative solutions, in different industries (Telco, Automotive, Resources, H&PS) and technologies (Middleware, Mobile App, Portals).\r\nToday is a Principal Presales Consultant and DevOps evangelist, supporting and promoting the DevOps and Continuous Delivery adoption for customers and partners.","role":"Principal Presales Consultant, DevOps","company":"CA Technologies","community":"","website":"","github":"","twitter":"","facebook":""},{"id":1614,"name":"Stefano","surname":"Sali","biography":"More than 12 years of experience in the information security, working with success at most of the biggest Italian company for Identity and Access Management projects.\r\nMy actual job role, Senior Principal Security Consultant for CA Technologies, includes technical presales activities as trusted advisory for large enterprise customers (across banking, telecom and other sectors) and partners, with main focus on solutions areas: IMAG, SSO, Advanced Authentication, API Management and Privileged Access Management.","role":"Senior Principal Consultant Security","company":"CA Technologies","community":"CISSP, ISACA","website":"","github":"","twitter":"@stefanosali","facebook":""},{"id":1647,"name":"Emanuele","surname":"Bolognesi","biography":"I'm Sr. Product Manager and Head of Design and Innovation at Docomo Digital. Programmer and geek since the times of the home computers, graduated in Computer Science, passionate about Mobile and Web development, User Experience, UI and Game Design. I have a long experience of managing and developing mobile apps and online products, having created websites and online services since 1998 but recently I have been focusing on games. I teach Scratch in primary schools and I like to give speeches about my passions when I find the time.","role":"Head of Design and Innovation","company":"Docomo Digital","community":"Mobile & Web Italy (organizer)","website":"http:\/\/www.emabolo.com","github":"","twitter":"@emabolo","facebook":""},{"id":1654,"name":"Francesca","surname":"Gigante","biography":"Business Development Architect @IBM having technical responsibility for HW\/SW solutions developed by assigned business partners.\r\nCurrent project are focused on IoT (Internet Of Things) and Cloud IaaS (Softlayer) and PaaS (Bluemix).\r\nMain other projects during last years are: ETL\/Data Warehouse\/Big Data, Mobile, Cloud, Server virtualization\/consolidation, Datacenter consolidation.","role":"Business Development Architect","company":"IBM","community":"https:\/\/www.facebook.com\/groups\/ibmbluemixitalia","website":"IBM.COM","github":"","twitter":"@francy_giant","facebook":""},{"id":1673,"name":"Florin","surname":"Patan","biography":"I'm a gopher for a few years now and I've used to do various things from simple toy apps to writing a startup based on it. I'm one of the organizers of the Go meetup in London and former organizer of GDG Berlin Golang and AWS Berlin User Group. In my spare time I pretend to contribute to the Go plugin for IntelliJ and other open-source projects.","role":"Cloud Software Engineer","company":"YouView TV Ltd.","community":"GDG Berlin Golang,Go London User Group,AWS User Group UK,CoreOS London,Kubernetes London","website":"https:\/\/florinpatan.ro","github":"https:\/\/github.com\/dlsniper","twitter":"@dlsniper","facebook":""},{"id":1692,"name":"Marco","surname":"Cuciniello","biography":"19yo developer","role":"CTO","company":"Becreatives","community":"","website":"http:\/\/arm4x.net","github":"","twitter":"@Arm4x","facebook":""},{"id":1693,"name":"Sean","surname":"Farmar","biography":"Sean Farmar holds the world record for answering the most NServiceBus questions - even more than Udi :-)\r\nWith over 20 years of experience, he specializes in providing simple solutions for complex business requirements using NServiceBus and applying SOA principles inspired by Udi Dahan.\r\n\r\nAs a solution architect with Particular Software, the creators of NServiceBus, Sean provides support, training and consulting for customers using NServiceBus and the Particular Platform.\r\n\r\nBlog: http:\/\/seanfarmar.com\r\nTwitter: https:\/\/twitter.com\/farmar","role":"Solutions Architect","company":"Particular Software","community":"Dublin Alt.net, Dublin Microservices","website":"http:\/\/seanfarmar.com","github":"https:\/\/github.com\/sfarmar","twitter":"@farmar","facebook":""},{"id":1723,"name":"Fabio","surname":"Mosca","biography":"Born in 1989, Fabio Mosca is a Virtual Reality specialist and co-founder at AnotheReality. \r\nWith a background as researcher (RMIT - Melbourne) and a bachelor degree in CS engineering (Polytechnic of Milan), he works as a game and virtual reality developer, creating games (Yon Paradox) under the label of Digital Mantis and cooperating with companies to bring new solutions with Virtual Reality.","role":"Virtual Reality Engineer","company":"AnotheReality","community":"","website":"https:\/\/www.anotherealityvr.com\/","github":"https:\/\/bitbucket.org\/Gounemond\/","twitter":"@Gounemond","facebook":"https:\/\/www.facebook.com\/Gounemond"},{"id":1726,"name":"Simona","surname":"Cotin","biography":"Simona is a full stack engineer building rich data visualization for network data in Corvil. She's very passionate about AngularJS and is part of the Dublin Meetup team.","role":"Software Engineer","company":"Corvil","community":"AngularJS Dublin","website":"","github":"https:\/\/github.com\/simonaco","twitter":"@simona_cotin","facebook":""},{"id":1740,"name":"Sander","surname":"Hoogendoorn","biography":"Sander is a dad, an independent consultant, software architect, programmer, speaker and writer. He coaches teams and helps improve software architectures and code. He's written books on agile, UML, and web tools, and published over 250 articles in international magazines. Sander is a (keynote) speaker and presents (in-house) training courses on subjects such as agile, Scrum, XP, Kanban, continuous delivery, software estimation, agile requirements, UML, design patterns, software architectures, microservices, and both Java and .NET development.","role":"Owner | CTO","company":"ditisagile.nl","community":"","website":"http:\/\/www.sanderhoogendoorn.com","github":"https:\/\/github.com\/aahoogendoorn","twitter":"@aahoogendoorn","facebook":""},{"id":1811,"name":"Steve","surname":"Smith","biography":"Steve Smith has worked at Atlassian for over 9 years, both as a sysadmin and a developer. Prior to that he worked on tanks and radars in the Outer Hebrides, telecoms systems in Hong Kong, and in startups in Australia. He now works out of Atlassian's UK offices, focusing on high-availability, continuous-deployment and platform migration issues.","role":"Developer Advocate","company":"Atlassian","community":"","website":"https:\/\/developer.atlassian.com\/blog\/authors\/ssmith\/","github":"https:\/\/bitbucket.org\/ssmith\/","twitter":"@tarkasteve","facebook":""},{"id":1842,"name":"Mark","surname":"Heckler","biography":"Mark Heckler is a Pivotal Principal Technologist & Developer Advocate, conference speaker, & published author focusing upon software development for the IoT & the Cloud. He has worked with key players in the manufacturing, retail, medical, scientific, telecom, & financial industries & various public entities to develop & deliver critical capabilities on time & on budget. Mark is an OSS contributor & author\/curator of a developer-focused blog (http:\/\/www.thehecklers.org) & an occasionally interesting Twitter account (@MkHeck).\r\n\r\nMark lives with his very understanding wife in St. Louis, MO USA.","role":"Developer Advocate","company":"Pivotal Software, Inc.","community":"Java, JavaFX, Spring","website":"http:\/\/www.thehecklers.org","github":"https:\/\/github.com\/mkheck","twitter":"@MkHeck","facebook":""},{"id":1844,"name":"Shmuela","surname":"Jacobs","biography":"Shmuela Jacobs is a senior front-end developer mastering AngularJS, at 500Tech, a leading Web Development company. She received her M.Sc. in Information Management Engineering from the Technion, Israel Institute of Technology, and B.Sc. in Physics from the Hebrew University of Jerusalem, Israel. Shmuela has gained experience in several software development environments and languages (C++, JAVA, Python), as a researcher and a software developer, and is now enjoying coding web applications using state-of-the-art technologies and frameworks.","role":"Front-end Developer","company":"500Tech","community":"AngularJS-IL, Javascript Israel, GDG","website":"","github":"https:\/\/github.com\/shmool","twitter":"@ShmuelaJ","facebook":""},{"id":1900,"name":"Davide","surname":"Di Pumpo","biography":"I'm a front-end developer with strong knowledge of design. \r\nI'm specialized in (S)CSS and DOM manipulation via Javascript.","role":"Senior Frontend Developer","company":"Objectway","community":"Milano Frontenders, MilanoJS, Milano UX\/UI\/IA","website":"","github":"https:\/\/github.com\/MakhBeth","twitter":"@makhbeth","facebook":""},{"id":1901,"name":"Alessandro","surname":"Del Sole","biography":"Alessandro Del Sole is a Senior .NET developer,trainer, and consultant focusing on Microsoft technologies such as WPF,C# and VB compilers, Visual Studio 2015,and Universal Windows Apps. Microsoft MVP for .NET since 2008 and MVP of The Year in 2009,2010,2011,2012 and 2014, he is Vice President of the Visual Basic Tips & Tricks Community.He authored many articles, books,and eBooks, including Visual Basic 2015 Unleashed, Visual Studio 2015 Succinctly,and Programmare con WPF 4.5. He regularly speaks at the most important Italian conferences and community events and is a frequent MSDN contributor.","role":".NET Solution Developer Expert","company":"Brain-Sys","community":"Visual Basic Tips & Tricks","website":"http:\/\/community.visual-basic.it\/Alessandro","github":"https:\/\/github.com\/AlessandroDelSole","twitter":"@progalex","facebook":""},{"id":1918,"name":"Nikos","surname":"Zinas","biography":"Nikos is working with web technologies since 2004. His main focus is designing solutions for large teams, helping companies scale and setup frontend architectures that are maintainable, performant, accessible and secure. Currently living in Greece and working as a Senior Software Engineer for Workday, a world wide company that offers enterprise-level software solutions for human resources and financial management.","role":"Senior software engineer","company":"Workday","community":"Co-organiser at devitconf.org Also member of SKGTech in Thessaloniki, Greece","website":"","github":"https:\/\/github.com\/zinas","twitter":"@nzinas","facebook":"https:\/\/www.facebook.com\/zinas.nikos"},{"id":1990,"name":"Tim","surname":"Perry","biography":"Tim Perry is a senior software engineer at resin.io, an IoT deployment and management platform. He's also the creator of Build Focus, a contributor to a huge range of open-source tools across the JS, Java and C# ecosystems, and maintainer of quite a few open-source projects of his own.","role":"Senior software engineer","company":"resin.io","community":"","website":"https:\/\/tim.fyi","github":"http:\/\/github.com\/pimterry","twitter":"@pimterry","facebook":""},{"id":2030,"name":"Mattia","surname":"Traverso","biography":"I started off as a freelance flash developer six years ago - highlights including \"One and One Story\", IGF finalist, and \"Secret of the Wings\", advergame for Disney's homonym movie.\r\n\r\nAfter thirty-something game jams and a specialisation in game design, I moved to the Netherlands to focus on bigger projects, founding the company Through Games for the game Fru, an upcoming experimental game for Xbox One.\r\n\r\nI just moved back to Italy to takea lead position for a new unannounced project, which I can't wait to share!","role":"Designer & Producer","company":"Through Games","community":"","website":"","github":"","twitter":"@MattiaNotFound","facebook":"https:\/\/www.facebook.com\/traversomat"},{"id":2034,"name":"Martijn","surname":"van Dijk","biography":"Martijn is a Xamarin consultant at Xablu, Xamarin MVP, contributor of MvvmCross, and creator of several Xamarin plugins.","role":"Xamarin Consultant","company":"Xablu","community":"Xamarin community","website":"http:\/\/mvvmcross.com","github":"https:\/\/github.com\/martijn00","twitter":"@mhvdijk","facebook":""},{"id":2078,"name":"Rossella","surname":"De Gaetano","biography":"Rossella studied mathematics university.\r\nShe started her carreer in IBM in the license management area as developer, then \r\nshe has been technical leader for a couple of asset management\r\nproducts. In the last few years, she joined the cloud division becoming the \r\nsubject matter expert for SmartCloud Provisioning and IBM Cloud Orchestrator\r\nand taking leadership roles in customer support and development.\r\nIn 2015 she has been appointed Senior Technical Staff Member and took over the \r\nresponsibility for Cloud Foundation Services business analytics.\r\nHobbies: 7 times italian Taekwondo champion","role":"Senior Technical Staff Member, Cloud Foundation Services","company":"IBM","community":"","website":"","github":"","twitter":"@DeGaRoss","facebook":""},{"id":2084,"name":"Leslie","surname":"Hawthorn","biography":"As an internationally known Developer Relations strategist and Community Management expert, Leslie has spent the past decade creating, cultivating, & enabling open source communities. She's best known for creating Google Code-in, the world's first global initiative to involve pre-university students in open source software development and receiving an O'Reilly Open Source Award in 2010 for her work to grow the Google Summer of Code program and her contributions to Humanitarian open source projects. She is a Senior Principal Program Manager at Red Hat, focusing on the CentOS project ecosystem.","role":"Senior Principal Program Manager","company":"Red Hat","community":"depends on what this means, I am a member of many. how will this info be used?","website":"http:\/\/community.redhat.com","github":"https:\/\/github.com\/lhawthorn","twitter":"http:\/\/twitter.com\/lhawthorn","facebook":"https:\/\/www.facebook.com\/lhawthorn"},{"id":2159,"name":"Luciano","surname":"Mammino","biography":"I am a Software Engineer born in 1987, the same year that the Nintendo released 'Super Mario Bros' in Europe, which, by chance is my favourite game! My primary passion is code and I am extremely fascinated by the web, smart apps and everything that's creative like music, art and design. I started coding at the age of 12 using my father's old i386 provided only with DOS and the qBasic interpreter. I am a senior PHP developer at Smartbox in Dublin, but I also love JavaScript (Angular\/React\/Node.js). I am the co-author of \"Node.js design patterns\" 2nd edition (Packt, http:\/\/amzn.to\/1ZF279B).","role":"Senior PHP Developer (Integrations)","company":"Smartbox","community":"PHP Dublin, Node.js Dublin","website":"http:\/\/loige.co","github":"https:\/\/github.com\/lmammino","twitter":"@loige","facebook":""},{"id":2304,"name":"Stefan","surname":"Armbruster","biography":"Stefan is working for 4+ years as a field engineer for Neo Technology, the company backing the open source graph database Neo4j. Before he has spent ~15 years as a freelance consultant. Aside from coding in the java ecosystem he is a passionate Linux veteran since the kernel 1.0.x days. When not coding, he tries to find the perfect espresso and works is a volunteer firefighter at the local fire department.","role":"Field Engineer","company":"Neo Technology","community":"GraphDB Munich, Dusseldorf, Berlin, ....","website":"http:\/\/www.neo4j.com","github":"https:\/\/github.com\/sarmbruster","twitter":"@darthvader42","facebook":""},{"id":2347,"name":"Alexandra","surname":"Marin","biography":"Alexandra has developed software for Fortune 500 companies in the pharmaceutical, logistics, gaming, video on demand, health, fitness and agricultural industries. Her focus is mobile and crossplatform development with Xamarin, but she's also fluent in C#, .NET and Unity. She blogs at crossplatform.io and loves attending as many user groups, code retreats and conferences as she can find.","role":"Software developer","company":"crossplatform.io","community":"","website":"http:\/\/crossplatform.io","github":"https:\/\/github.com\/alexandra-marin","twitter":"@xmonodev","facebook":""},{"id":2378,"name":"Natalie","surname":"Pistunovich","biography":"Natalie is a Backend Developer at adjust. Prior to that she was at the Silicon Integration team in Intel, and graduated B.Sc. in Software and Computer Engineering from the Technion. In her free time she is a Golang Berlin meetups co-organizer, Women Techmakers Berlin lead and a good music appreciator.","role":"Backend Engineer","company":"adjust","community":"Women Techmakers, GDG Golang","website":"","github":"","twitter":"nataliepis","facebook":""},{"id":2383,"name":"Andrea","surname":"Del Fiandra","biography":"Andrea (@delfioh) is an IT Technician and has been working in the field for 8 years.\r\nBig coding enthusiast since age 11, he started programming on his parents' Commodore 64 in Basic and then moved on to other languages such as C\/C++ and, a little more recently, C#.\r\nHe loves figuring out how things work behind the scenes, as he believes the true fun in being a programmer is the search for more knowledge.","role":"IT Technician","company":"Independent","community":"","website":"","github":"https:\/\/github.com\/delfioh","twitter":"@delfioh","facebook":""},{"id":2389,"name":"Stenver","surname":"Jerkku","biography":"Stenver is the kind of person who is passionate about coding, open source and startups but also has a natural knack for people. He loves to teach and spread the word about his discoveries to the world. The one thing that puts a smile on his face is to inspire people to try out things they thought impossible.","role":"CTO and co-founder","company":"eAgronom","community":"","website":"","github":"http:\/\/github.com\/stenver\/","twitter":"https:\/\/twitter.com\/stenverjerkku","facebook":"https:\/\/www.facebook.com\/stenver"},{"id":2390,"name":"Luis","surname":"G. Valle","biography":"Software Craftsman @ Novoda.\r\n\r\nI am a firm believer in simple, well-made things. Which I like to apply to code, interfaces and processes. \r\n\r\nI've been recently focused on advocating for better team communication. I believe this is key to produce quality software in any company.\r\n\r\nI am passionate about reading, talking and writing about software craftsmanship. Sharing experiences is the most rewarding way to improve the community.","role":"Team Lead","company":"Novoda","community":"GDG Sevilla, GDG Madrid, GDG London, Londroid","website":"http:\/\/lgvalle.xyz","github":"github.com\/lgvalle","twitter":"@lgvalle","facebook":""},{"id":2391,"name":"Atreyam","surname":"Sharma","biography":"Atreyam (Leo) is one of the youngest entrepreneurs, technology dreamers, coders and hard core gamers in Continental Europe. He has the unique distinction of being a teacher for the young generation in the age group of 7 years through Workshop4Me. He regularly runs coding events for Geek Week Luxembourg, EU Code Week, spoke at the Geek Girls Carrots event and taught Vedic Mathematics. He has been speaker at technology events, including the LIFT Conference in Geneva. Apart from teaching, Atreyam develops iOS apps and games.","role":"Co-Founder and Vice President","company":"Workshop4Me a.s.b.l","community":"Syn2Cat, Level2 Hackerspace, Geek Week Luxembourg, EU Code Week, Geek Girls Carrots","website":"www.workshop4me.org","github":"","twitter":"@workshop4me","facebook":"Workshop4Me"},{"id":2393,"name":"Michal","surname":"Franc","biography":"Pragmatic lead dev that helps JustGiving build a social charity platform for 23+ mln users. Expert in .NET, interested in functional programming and JavaScript. VIM user, micro-services fan. Blog author www.mfranc.com, speaker. Found on twitter @francmichal and github michal-franc.","role":"Lead Developer","company":"JustGiving","community":"","website":"www.mfranc.com","github":"https:\/\/github.com\/michal-franc\/","twitter":"@francmichal","facebook":"https:\/\/www.facebook.com\/michal.franc.9"},{"id":2399,"name":"Paolo","surname":"Montrasio","biography":"Developer since the 80s, architect and project manager in the 90s and early 00s, back to software design and development in the last 10 years. Many technologies under the belt, such as C, Perl, HTML\/CSS, Java, JavaScript, Ruby on Rails. Doing some work with Elixir and Phoenix lately, plus some AWS Lambda and chatbots. Owner of connettiva.eu.","role":"owner","company":"Connettiva","community":"","website":"https:\/\/connettiva.eu","github":"http:\/\/github.com\/pmontrasio\/","twitter":"@pmontrasio","facebook":""},{"id":2429,"name":"Kamilla","surname":"Khabibrakhmanova","biography":"Kamilla is a fullstack javascript engineer working primarily with AngularJS and NodeJS in the NYC startup scene. She is actively involved in groups promoting women in tech and various local tech meetups. In her free time, she also volunteers teaching kids to code through an organization called CoderDojo.","role":"Software Engineer","company":"GLAMSQUAD","community":"WomenWhoCode, CoderDojo, NgNYC, GothamSass, NYC NodeJS","website":"http:\/\/www.kamilla.io","github":"https:\/\/github.com\/KamillaKhabibrakhmanova","twitter":"@kabibster","facebook":""},{"id":2447,"name":"Simone","surname":"Lippolis","biography":"I joined frog in 2010, but started writing software when COBOL was a hype word. Now my interests span from bots and conversational interfaces, to data-visualization, to embedded applications and IOT.","role":"Senior Design Technologist","company":"Frog","community":"","website":"http:\/\/simonelippolis.com","github":"","twitter":"@simonelippolis","facebook":""},{"id":2451,"name":"Sebastiano","surname":"Gottardo","biography":"Sebastiano is a CS M.Sc. currently working at Musixmatch as an Android engineer. He is passionate about mobile security and cutting edge technologies, matured while working with companies like Megavideo and several other startups. He now actively contributes to the Android community with online articles and tutorials.","role":"Android Engineer","company":"Musixmatch","community":"","website":"","github":"https:\/\/github.com\/dextorer","twitter":"@rotxed","facebook":""},{"id":2470,"name":"Karina","surname":"Popova","biography":"Karina is a well-known speaker, has been worked as DevOps Lead last 10 years. She has confident communication, leadership skills across different levels, developed through international professional interaction and engagements with representatives of various government institutions or IT companies using agile environment across the world. Her social responsibility and communicative competence are demonstrated in the organization of professional networks, events and conferences. At the same time she gained public speaking skills through frequent workshops and as a speaker at IoT and DevOps conf","role":"DevOps\/System Engineer Lead","company":"whatever mobile GmbH","community":"","website":"http:\/\/karinapopova.com\/","github":"","twitter":"@kary_key","facebook":"https:\/\/www.facebook.com\/PopovaKarina"},{"id":2487,"name":"Vitaly","surname":"Sharovatov","biography":"I'm 32 y.o. web-developer and I specialise in client-side, web apps architecture and performance. I started working in client-side development area back in 1999, had all the fun supporting IE5.01\/Opera 7 in commercial projects with semantic markup, proper CSS and unobtrusive js much before jQuery or other popular tools appeared, so had the wonderful time of discovering all the browsers incompatibilities and quirks. As of 2003, I also started designing web apps achitecture with proper perfomance in mind, studied HTTP\/1.0 and 1.1 spec, learnt DB theory and practiced in Mysql\/MSSQL.","role":"Mobile Web Team Lead","company":"Badoo","community":"","website":"http:\/\/sharovatov.github.io","github":"","twitter":"","facebook":""},{"id":2491,"name":"Alessio","surname":"Fattorini","biography":"Linux Sysadmin and Support Specialist for 10 years at Nethesis, up until about 2 years ago when I became the NethServer Community Manager ( Linux Server Distribution that makes sysadmin's life easier) thus I started to study everything about community stuff and be deeply involved in all community managers communities around.\r\nCLSxItaly co-organizer and Certified Community Strategist, I'm mainly focused on product-based communities, working closely with developers and users.","role":"Community Manager","company":"NethServer","community":"NethServer,Community Leadership Summit,CMXHub,Feverbee,Discourse","website":"www.nethserver.org","github":"","twitter":"@ale_fattorini","facebook":""},{"id":2497,"name":"Alaina","surname":"Percival","biography":"Alaina is CEO of Women Who Code, a nonprofit dedicated to inspiring women to excel in technology careers. Under Alaina's leadership, WWCode has grown to serve more than 50,000 in 20 countries across 60 cities. This thriving movement offers 1,000+ free technical events, per year. In addition to her role at WWCode, Percival is an accomplished tech speaker, appearing at WSJ.d Live, NodeConf, Grace Hopper, MIT's Venture Capital & Innovation and more. Alaina's been interviewed by Forbes, WSJ, Wired, and other publications across the globe to share her expertise on diversity best practices.","role":"CEO","company":"Women Who Code","community":"","website":"womenwhocode.com","github":"github.com\/womenwhocode","twitter":"@alaina","facebook":"fb.com\/womenwhocode"},{"id":2499,"name":"Simona","surname":"Russo","biography":"Graduated in Computer Science with honors at the Statale University in Milan, she has more than 20 years of experience in major Italian software houses where she participated, as lead developer and software development manager, to the development of leading proprietary software products in the fields of logistics, finance, payroll and search engine.","role":"Senior Sw Engineer\/Head of R&D","company":"FacilityLive","community":"","website":"","github":"","twitter":"","facebook":""},{"id":2502,"name":"Lorenzo","surname":"Ridi","biography":"Lorenzo is a Software Engineer, curious by nature - he loves coding, experimenting new technologies and breaking things. He also recently became a Google Cloud Platform Authorised Trainer, and he LOVES telling his fellow coders how the Cloud can transform their way of coding, experimenting and break... well, no.","role":"Software Engineer and Technical Trainer","company":"Noovle","community":"","website":"","github":"","twitter":"@LorenzoRidi","facebook":"https:\/\/www.facebook.com\/lorenzo.ridi"},{"id":2516,"name":"Auro","surname":"Rolle","biography":"As Performance Architects I design, deliver, and optimize high-performing systems. I contribute to all aspects of the delivery lifecycle in performance prototyping, capacity modeling, performance driven design, profiling, performance testing, availability management, and troubleshooting. A Performance Architect provides architecture and application design and development guidance that ensures scalability and minimizes performance issues.","role":"Senior Test Automation Engineer","company":"FacilityLive","community":"","website":"","github":"","twitter":"","facebook":""},{"id":2527,"name":"Giulio","surname":"Santoli","biography":"I&#039;m technology addict since I started programming on my Commodore VIC-20... and I didn&#039;t stop.\r\nAfter a log experience as software developer in IBM Tivoli, I worked in IBM Rational and IBM Cloud and now I&#039;m working as Cloud Solution Architect in Microsoft.\r\nMy favorite topics are microservices architectures, machine learning and functional programming languages.","role":"Cloud Solution Architect","company":"Microsoft","community":"","website":"","github":"","twitter":"@gjuljo","facebook":""},{"id":2536,"name":"Davide","surname":"Papini","biography":"Davide Papini is a cyber-security researcher, working in R&D in Elettronica. His research mainly focuses on cyber situational awareness, network security and machine learning applied to security related problems. He holds a PhD from DTU Copenhagen, and has been a PostDoc researcher at the Information Security Group at Royal Holloway, where he had the opportunity to work on practical security related problems, such as botnet and malware detection, network monitoring and internet security assessments.","role":"Research and Innovation","company":"Elettronica S.p.a.","community":"","website":"","github":"","twitter":"@dadopap","facebook":""},{"id":2538,"name":"Fabrizio","surname":"Marini","biography":">20 years industry (K-Tech, Bea Systems, Oracle), 7 years senior management as entrepeneur in K-Tech (www.k-tech.it), 13 years experience selling\/building on-premise and cloud solutions.\r\n\r\nTrusted customer advisor with >20 years of experience in collaborating with clients, including engineering staff, line of business, and senior executives. \r\n\r\nJEE & Cloud Expert, Architect, Team Leader, Mentor, Teacher, Problem Solver, Developer, Blogger","role":"Master Principal Sales Consultant","company":"Oracle","community":"MeetUP DevOps","website":"http:\/\/www.fabriziomarini.com\/","github":"","twitter":"@MaleficoMarini","facebook":"https:\/\/www.facebook.com\/biziomarini"},{"id":2558,"name":"Maurizio","surname":"de Gregorio","biography":"CEO and Founder of Parterre. The company offers a new service focused on engaging audiences or large groups of people by means of voting, polls, and social networks contents through mobile apps with an amazing user experience . Parterre has a wide portfolio of offers targeting awards events, TV shows, radio, sports, celebrity, brands and market researches.","role":"CEO and founder","company":"Parterre Srl","community":"","website":"http:\/\/parterre.eu","github":"","twitter":"@mauideg","facebook":""},{"id":2585,"name":"Luca","surname":"Relandini","biography":"I'm a Solution Architect at Cisco, in a European team focused on Data Center, Automation and Cloud Computing. I work at IT and cloud projects using both Cisco's software\/hardware products, open source (Openstack, Docker) and 3rd party products.\r\n\r\nAfter a career as Enterprise Architect in the IT industry at large enterprises, system integrators and software vendors I learned that the human factor (i.e. organization and governance, as well as alignment between Business and IT Strategies, and a sound architectural design that never hurts) is more important than technology as a success factor","role":"Solution Architect","company":"Cisco Systems","community":"Openstack User Group Italy, Cisco DevNet","website":"http:\/\/lucarelandini.blogspot.com\/","github":"","twitter":"@lucarelandini","facebook":""},{"id":2588,"name":"Steve","surname":"Sfartz","biography":"DevNet is Cisco's Developer Program.\r\nPart of my evangelism activity is to help Developers and ITPros differentiate and accelerate their business by leveraging CISCO APIs.\r\nYou're a startup, an enterprise or an ISV ? Feel free to ping me to discuss innovation and how to integrate CISCO APIs into your software. As a strong supporter of Web APIs, I have committed myself to teach dev communities WW how to consume and build APIs with various languages.\r\nREST APIs, Collaboration (Tropo, Cisco Spark), Cloud Services, golang\r\nFrance mostly and all around Europe.","role":"API Evangelist","company":"CISCO","community":"devnet, REST, opensource, golang, javascript, nodejs","website":"https:\/\/developer.cisco.com\/","github":"","twitter":"@SteveSfartz","facebook":""},{"id":2604,"name":"Jonathan","surname":"Field","biography":"Jonathan spends his time with developer communities, startups and Cisco customers helping them to build the next generation of business bots and integrations for the Cisco Spark platform.","role":"Business Development","company":"Cisco","community":"","website":"","github":"http:\/\/github.com\/jfield44\/","twitter":"@jfield44","facebook":""},{"id":2606,"name":"Emilio","surname":"De Lazzari","biography":"I have a deep background in product management, web development and business growth. Building and running teams, hands on product development and guidance from concept through launch and beyond on web and mobile projects is my specialty.\r\n\r\nIn the last 20 years I helped my own, and many other organizations and businesses to improve their online presence through pragmatic leadership and direction by selecting and designing the best architecture using different technologies. I began developing web-based applications with my own company in Italy in 1996 and have been involved in the recent acquis","role":"CTO","company":"Parterre SRL","community":"","website":"http:\/\/www.parterre.eu","github":"","twitter":"","facebook":""},{"id":2607,"name":"Stefano","surname":"Zacchiroli","biography":"Stefano Zacchiroli is Associate Professor of Computer Science at University Paris Diderot on leave at Inria. His research interests span formal methods, software preservation, and Free\/Open Source Software engineering. He is a co-founder and current CTO of the Software Heritage project. He is an official member of the Debian Project since 2001, where he was elected to serve as Debian Project Leader for 3 terms in a row over the period 2010-2013. He is a Board Director of the Open Source Initiative (OSI) and recipient of the 2015 O'Reilly Open Source Award.","role":"CTO","company":"Software Heritage","community":"Debian, Software Heritage","website":"https:\/\/upsilon.cc\/~zack\/","github":"https:\/\/github.com\/zacchiro","twitter":"@zacchiro","facebook":""},{"id":2610,"name":"Marco","surname":"Ramilli","biography":"Marco Ramilli, CTO and co-founder of Yoroi, is a computer scientist researcher with an intensive hacking background. With a PhD in Computer Science Security from the University of Bologna, Marco has been working with US Government (National Institute of Standards and Technology, Security Division) and University of California, Davis on new security paradigms, penetration testing methodologies and electronic voting systems' security and Malware. Marco decided to co-founding Yoroi believing in a human centric cyber defence approach which took him to build Yoroi Cyber Security Defence Center.","role":"Founder","company":"Yoroi","community":"IEEE, ACM","website":"http:\/\/www.marcoramilli.com","github":"https:\/\/github.com\/marcoramilli","twitter":"","facebook":""},{"id":2613,"name":"Antonio","surname":"Nappi","biography":"Antonio is a young software engineer working for Indra, one of the main global consulting and technology companies. Graduated in Computer Science, he is working as a web and mobile applications specialist for the Indra's Software Lab in Naples. Antonio is constantly studying to improve his knowledge and technical skills.","role":"Software Engineer","company":"Indra","community":"","website":"","github":"","twitter":"","facebook":""},{"id":2623,"name":"Maurizio","surname":"Tatafiore","biography":"* I am a skilled videogame and interactive experiences programmer.\r\n* Specialized in game logic and interaction programming.\r\n* Proficient with many tools, always willing to learn some new.\r\n* I have a passion for videogame design.","role":"Co-founder and CTO","company":"Hypothermic Games Studio","community":"","website":"http:\/\/www.oldschoolpixels.com","github":"","twitter":"","facebook":""},{"id":2641,"name":"Angelo","surname":"Fienga","biography":"Angelo joined back Cisco Systems in 2011 as Architect for mobile strategy in the WW Collaboration Sales and Strategy team, looking after the design and evolution of complex solutions for enterprises and service providers.\r\nIn last few years Angelo has been spearheading the strategy for highly disruptive technologies such as Drones, and the application of Cisco technologies to the rising market of UAVs. \r\nIn his 20+ years career he worked both in start-ups and in top fortune 500 companies. \r\nAngelo owns a M.Sc. in Electronic Engineering from the University in Rome. \r\nHe is married with two children","role":"Architect, Mobile Collaboration","company":"Cisco","community":"","website":"","github":"","twitter":"","facebook":""},{"id":2660,"name":"Mike","surname":"Lee","biography":"Mike Lee is an American engineer living in Amsterdam. Like many people, he dreamed of finding a better life in technology. Mike was at the birth of mobile, and has worked on many interesting projects, even at Steve Jobs' Apple. Mike continues to code full-time while contributing to community projects such as AltConf and Appsterdam. You can find him on Twitter @bmf.","role":"Mayor","company":"Appsterdam","community":"Appsterdam","website":"http:\/\/appsterdam.rs","github":"","twitter":"@bmf","facebook":""},{"id":2662,"name":"Jason","surname":"Goecke","biography":"Jason Goecke leads a team focused on evolving the vision of the Cloud Collaboration Platform. He is responsible for building, promoting, & supporting the Spark ecosystem, a key part of the platform. Jason is focused on accelerating the growth of the developer community.\r\nJason led Tropo as Co-Founder\/President\/CEO & joined Cisco as part of an acquisition. Tropo's cloud API platform lets developers easily build applications with real-time voice & SMS capabilities. \r\nJason has been an advisor to Ericsson, Telstra & the Adhearsion Foundation. He holds several patents in real-time communications.","role":"General Manager","company":"Cisco","community":"","website":"","github":"https:\/\/github.com\/jsgoecke","twitter":"https:\/\/twitter.com\/jsgoecke","facebook":""},{"id":2668,"name":"Chrissy","surname":"Welsh","biography":"Chrissy Welsh is the Creative Lead & Director for Philips, based in Amsterdam. She is interested in the potential of bleeding edge' technologies in user experience design to make products easy and pleasurable to use. She has over 10 years design experience and has worked with a variety of industries including software development, healthcare and education. Before Philips, Chrissy was the Lead & Principle UX for Backbase where she designed user experiences & apps for the financial sector.","role":"Creative Lead & Director","company":"Philips","community":"","website":"www.christinewelsh.com","github":"","twitter":"@chrissywelsh","facebook":""},{"id":2675,"name":"Paul","surname":"Bellamy","biography":"Paul Bellamy is an Engineer at Weaveworks, building open-source tools, to connect, observe, and control Docker containers. Having bounced between development and operations, his previous experience includes Internet of Things messaging protocols, time-series data analysis, and E-commerce operations.","role":"Software Engineer","company":"Weaveworks","community":"","website":"http:\/\/paulbellamy.com","github":"http:\/\/github.com\/paulbellamy","twitter":"@pyrhho","facebook":""},{"id":2689,"name":"Ivan","surname":"Daniluk","biography":"Ivan Daniluk is a senior software engineer at Typeform. Ivan has more than decade of experience in writing networking software for security market. He's an active member of the Go community, a conference speaker, the host of the GolangShow podcast, and organizer of Golang meetups, the author of numerous articles about Go, and the author of a few popular projects for gophers. Ivan enjoys helping people to learn about Go and programming and is highly interested in neural networks, artificial intelligence, neuroscience, visualizations, and new approaches to education in general.","role":"Senior Engineer","company":"Typeform","community":"","website":"","github":"https:\/\/github.com\/divan","twitter":"@idanyliuk","facebook":""},{"id":2700,"name":"Andrea","surname":"Tabacco","biography":"Andrea Tabacco is an eclectic professionist active in the game industry since 2005. Andrea has worked both for big companies such as Ubisoft and Forge Reply as well as an indie developer, self-publishing one-man-team games for consoles and mobile devices.\r\nFollowing the desire to dedicate all his efforts and time to his own company, Andrea has founded AntabStudio at the beginnings of 2016.","role":"CEO and Senior Designer","company":"Antab Studio Srl","community":"","website":"http:\/\/www.antabstudio.com","github":"","twitter":"@AntabStudio","facebook":"https:\/\/www.facebook.com\/AntabStudio"},{"id":2707,"name":"Lara","surname":"Gianotti","biography":"Lara worked some years as graphic designer and art director both for digital and traditional media, but her real passion as always been game development and game design.\r\nAs AntabStudio Co-Founder Lara is using her skills in visual comunication, design and marketing to make the company grow as a brand, and to partecipate in the development of AntabStudio's currently work-in-progress title.","role":"Co-founder and Junior Designer","company":"Antab Studio Srl","community":"","website":"http:\/\/www.antabstudio.com","github":"","twitter":"@AntabStudio","facebook":""},{"id":2721,"name":"Alessandro","surname":"Melchiori","biography":"Software craftsman, husband, father, ex-sportsman and inquiring reader. Since I was young I have loved taking apart and reassembling things to understand how they work. Now, this passion has become my job: the step from Lego to software development was small.\r\nFinding the best possible solution so that a complex system can work at its best and making it run smoothly are the goals of my work. C#, ESB, MongoDb and Azure make up my survival toolkit and help me cruise through distributed systems and enterprise solutions, with ease.","role":"Software developer","company":"CodicePlastico srl","community":"ugidotnet webdebs","website":"http:\/\/www.codiceplastico.com","github":"https:\/\/github.com\/melkio","twitter":"@amelchiori","facebook":"https:\/\/www.facebook.com\/melkio"},{"id":2727,"name":"Eleanor","surname":"McHugh","biography":"London-based hacker Ellie has a passion for the esoteric corners of programming stretching back to her misspent teenage years. During the course of her career she's worked on mission critical systems ranging from avionics to banking security and digital trust arbitration. Ellie's the author of A Go Developer's Notebook and talks on low-level, network and security programming in Ruby & Go.\r\n\r\nAs a responsible parent Ellie enjoys polyhedral dice, home brewing and gothic music.","role":"Director","company":"Innovative Identity Solutions Limited","community":"ruby, golang","website":"http:\/\/inidsol.uk","github":"http:\/\/github.com\/feyeleanor","twitter":"@feyeleanor","facebook":""},{"id":2762,"name":"Adriano","surname":"Urso","biography":"Io non sono il target di riferimento :) \r\nQuando sono soddisfatto cerco in tutti i modi di coinvolgere qualcuno per festeggiare insieme.\r\nDel mio lavoro amo la possibilita costante di migliorare il mondo.\r\nCTO @ Endurance Group srl, Founder @ Shangri-La Farm, Founder @ ilCapitano.farm\r\nNNg UX Certified everywhere","role":"CTO","company":"Endurance Group srl","community":"Milano Chatbots Meetup","website":"http:\/\/endurancecloud.com","github":"","twitter":"@heyyoudesign","facebook":"https:\/\/www.facebook.com\/aggianello"},{"id":2763,"name":"Vittorio","surname":"Banfi","biography":"Co-Founder of BotSociety.io","role":"Co-Founder","company":"BotSociety","community":"","website":"https:\/\/botsociety.io","github":"","twitter":"","facebook":""},{"id":2765,"name":"Emanuele","surname":"Capparelli","biography":"Ingegnere aerospaziale, coder, appassionato di Machine Learning e Intelligenza Artificiale.","role":"Founder","company":"Bot Company","community":"","website":"http:\/\/www.botcompany.it","github":"","twitter":"","facebook":""},{"id":2773,"name":"Alessandro","surname":"Muraro","biography":"Heavyweight UI Wrestler. Perfect is the enemy of good. I work @objectway_fs and organise @milanofrontend meetup.","role":"UI Developer","company":"Objectway","community":"Milano Front End Meetup","website":"https:\/\/alexmuraro.me","github":"https:\/\/github.com\/akmur","twitter":"@akmur","facebook":""},{"id":2774,"name":"Giacomo","surname":"Zinetti","biography":"Hello world! Sono un programmatore nato il 15 giugno 1984 e vivo a Bregnano, un paesino tranquillo in provincia di Como.\r\n\r\nLa mia passione e il web e la coltivo ogni giorno costruendo siti e applicazioni migliori con UX innovative, grafiche accattivanti e utilizzando le piu recenti tecnologie. Adoro lavorare in team con altri fanatici del web con i quali condividere le esperienze, le conoscenze e gli ultimi aggiornamenti dal mondo tecnologico.","role":"Senior Frontend Developer","company":"The Outplay","community":"Milano Frontend","website":"https:\/\/giko.it","github":"","twitter":"@giacomozinetti","facebook":""},{"id":2845,"name":"Giuseppe Enrico","surname":"Franchi","biography":"Software developer with a Game Design master, Giuseppe started studying and creating games when he realised the life of a coder was too much work. How nave.\r\nHe co-founded 34BigThings in 2013, where he worked on Hyperdrive Massacre, the recent Steam hit Redout, and a number of B2B projects as a consultant.","role":"Lead Game Designer","company":"34BigThings","community":"","website":"34bigthings.com","github":"","twitter":"@gefranchi","facebook":""},{"id":2848,"name":"Pepper","surname":"P.","biography":"He's an autonomous talking humanoid robot who perceives emotions, and adapts his behavior to the mood of the humans around him. Pepper identifies joy, sadness, anger or surprise and respond appropriately, making his interactions with humans incredibly natural and intuitive.","role":"Robot","company":"IBM","community":"https:\/\/www.facebook.com\/groups\/ibmbluemixitalia","website":"ibm.com","github":"","twitter":"","facebook":""},{"id":2853,"name":"Gerardo","surname":"Verna","biography":"Trinity Team  e un piccolo team indipendente nato a Ottobre 2015 in occasione della Spaghetti Western Jam e composto da  game developers professionisti.","role":"Programmatore","company":"Trinity Team","community":"","website":"","github":"","twitter":"","facebook":""},{"id":2854,"name":"Fabrizio","surname":"Zagaglia","biography":"Programmatore \/ Grafico 3D - 2D \r\n\r\n-Giochi pubblicati:\r\n  -ALBEDO: eyes from outer space ( PC \/ PS4 \/ XB1 )\r\n-Giochi pubblicati (conto terzi):\r\n  -Nicolas Eymerich - The Inquisitor I\/II (TiconBlu)\r\n  -Syder Arcade (Studio Evil)\r\n-Jam \/ Contests:\r\n  Schiaffi&Fagioli, Master of Clowns, 2001: A time odissey, DoT","role":"Programmer \/ Graphic","company":"Fabrizio Zagaglia","community":"","website":"http:\/\/www.z4g0.com","github":"","twitter":"@_z4g0_","facebook":"https:\/\/www.facebook.com\/fabrizio.zagaglia.9"},{"id":2855,"name":"Marco","surname":"Agricola","biography":"Some of my works:\r\nMy Little Cook\r\nFantasea\r\nNicolas Eymerich: Inquisitor\r\nBlack Viper: Sophia's Fate\r\nShe Noire\r\nSchiaffi & Fagioli\r\nRiot: Civil Unrest\r\nSlaps And Beans","role":"Programmer","company":"Trinity Team","community":"","website":"","github":"","twitter":"","facebook":""},{"id":2856,"name":"Enzo","surname":"Carrea","biography":"Enzo (Vincenzo) is senior software engineer working for Indra with 20 years of experience.\r\nTeam Leader in  energy  (ENI, SAIPEM), Finance (INPS), and Telco (TIM) projects;\r\nResponsible for research and innovation of new technology for the Indra's Software Lab in Naples.\r\nHe is workings as web, mobile, Virtual Reality applications specialist for the Indra's Software Lab in Naples.","role":"Team Leader","company":"Indra","community":"","website":"www.indracompany.com","github":"","twitter":"","facebook":""}],"speakerstotalks":[{"speakerid":48,"talkid":3584,"eventid":21,"role":"speaker"},{"speakerid":57,"talkid":4292,"eventid":21,"role":"speaker"},{"speakerid":68,"talkid":3544,"eventid":21,"role":"speaker"},{"speakerid":140,"talkid":5387,"eventid":21,"role":"speaker"},{"speakerid":141,"talkid":3699,"eventid":21,"role":"speaker"},{"speakerid":168,"talkid":5104,"eventid":21,"role":"speaker"},{"speakerid":173,"talkid":4473,"eventid":21,"role":"speaker"},{"speakerid":185,"talkid":3560,"eventid":21,"role":"speaker"},{"speakerid":190,"talkid":5248,"eventid":21,"role":"speaker"},{"speakerid":190,"talkid":5385,"eventid":21,"role":"speaker"},{"speakerid":226,"talkid":4083,"eventid":21,"role":"speaker"},{"speakerid":266,"talkid":4232,"eventid":21,"role":"speaker"},{"speakerid":282,"talkid":3725,"eventid":21,"role":"speaker"},{"speakerid":303,"talkid":4450,"eventid":21,"role":"speaker"},{"speakerid":310,"talkid":4415,"eventid":21,"role":"speaker"},{"speakerid":327,"talkid":4422,"eventid":21,"role":"cospeaker"},{"speakerid":332,"talkid":4107,"eventid":21,"role":"speaker"},{"speakerid":342,"talkid":4644,"eventid":21,"role":"speaker"},{"speakerid":359,"talkid":4422,"eventid":21,"role":"speaker"},{"speakerid":385,"talkid":5131,"eventid":21,"role":"speaker"},{"speakerid":391,"talkid":4435,"eventid":21,"role":"speaker"},{"speakerid":391,"talkid":5383,"eventid":21,"role":"speaker"},{"speakerid":404,"talkid":3539,"eventid":21,"role":"speaker"},{"speakerid":470,"talkid":5113,"eventid":21,"role":"speaker"},{"speakerid":480,"talkid":5224,"eventid":21,"role":"speaker"},{"speakerid":485,"talkid":3608,"eventid":21,"role":"speaker"},{"speakerid":485,"talkid":4824,"eventid":21,"role":"speaker"},{"speakerid":525,"talkid":3988,"eventid":21,"role":"speaker"},{"speakerid":578,"talkid":3682,"eventid":21,"role":"speaker"},{"speakerid":599,"talkid":3908,"eventid":21,"role":"speaker"},{"speakerid":603,"talkid":4645,"eventid":21,"role":"speaker"},{"speakerid":636,"talkid":4299,"eventid":21,"role":"speaker"},{"speakerid":693,"talkid":3567,"eventid":21,"role":"speaker"},{"speakerid":729,"talkid":4393,"eventid":21,"role":"speaker"},{"speakerid":735,"talkid":4685,"eventid":21,"role":"speaker"},{"speakerid":737,"talkid":4685,"eventid":21,"role":"cospeaker"},{"speakerid":798,"talkid":5386,"eventid":21,"role":"cospeaker"},{"speakerid":816,"talkid":3886,"eventid":21,"role":"speaker"},{"speakerid":889,"talkid":5298,"eventid":21,"role":"speaker"},{"speakerid":982,"talkid":3551,"eventid":21,"role":"speaker"},{"speakerid":993,"talkid":4246,"eventid":21,"role":"speaker"},{"speakerid":1086,"talkid":4410,"eventid":21,"role":"speaker"},{"speakerid":1121,"talkid":5237,"eventid":21,"role":"speaker"},{"speakerid":1139,"talkid":4450,"eventid":21,"role":"cospeaker"},{"speakerid":1146,"talkid":3907,"eventid":21,"role":"speaker"},{"speakerid":1148,"talkid":5131,"eventid":21,"role":"cospeaker"},{"speakerid":1178,"talkid":4726,"eventid":21,"role":"speaker"},{"speakerid":1336,"talkid":3899,"eventid":21,"role":"speaker"},{"speakerid":1336,"talkid":3900,"eventid":21,"role":"speaker"},{"speakerid":1530,"talkid":4414,"eventid":21,"role":"speaker"},{"speakerid":1611,"talkid":5161,"eventid":21,"role":"speaker"},{"speakerid":1614,"talkid":5161,"eventid":21,"role":"cospeaker"},{"speakerid":1647,"talkid":3958,"eventid":21,"role":"speaker"},{"speakerid":1654,"talkid":5352,"eventid":21,"role":"speaker"},{"speakerid":1673,"talkid":4011,"eventid":21,"role":"speaker"},{"speakerid":1692,"talkid":4172,"eventid":21,"role":"cospeaker"},{"speakerid":1693,"talkid":3537,"eventid":21,"role":"speaker"},{"speakerid":1723,"talkid":4339,"eventid":21,"role":"speaker"},{"speakerid":1726,"talkid":3868,"eventid":21,"role":"speaker"},{"speakerid":1740,"talkid":3609,"eventid":21,"role":"speaker"},{"speakerid":1811,"talkid":4016,"eventid":21,"role":"speaker"},{"speakerid":1842,"talkid":3590,"eventid":21,"role":"speaker"},{"speakerid":1844,"talkid":4154,"eventid":21,"role":"speaker"},{"speakerid":1900,"talkid":3680,"eventid":21,"role":"speaker"},{"speakerid":1901,"talkid":4290,"eventid":21,"role":"speaker"},{"speakerid":1918,"talkid":3742,"eventid":21,"role":"speaker"},{"speakerid":1990,"talkid":4365,"eventid":21,"role":"speaker"},{"speakerid":2030,"talkid":5094,"eventid":21,"role":"speaker"},{"speakerid":2034,"talkid":3761,"eventid":21,"role":"speaker"},{"speakerid":2078,"talkid":5298,"eventid":21,"role":"cospeaker"},{"speakerid":2084,"talkid":4497,"eventid":21,"role":"speaker"},{"speakerid":2159,"talkid":4630,"eventid":21,"role":"speaker"},{"speakerid":2304,"talkid":3586,"eventid":21,"role":"speaker"},{"speakerid":2347,"talkid":3862,"eventid":21,"role":"speaker"},{"speakerid":2378,"talkid":3801,"eventid":21,"role":"speaker"},{"speakerid":2383,"talkid":4172,"eventid":21,"role":"speaker"},{"speakerid":2389,"talkid":3851,"eventid":21,"role":"speaker"},{"speakerid":2390,"talkid":3857,"eventid":21,"role":"speaker"},{"speakerid":2391,"talkid":4280,"eventid":21,"role":"speaker"},{"speakerid":2393,"talkid":4003,"eventid":21,"role":"speaker"},{"speakerid":2399,"talkid":3883,"eventid":21,"role":"speaker"},{"speakerid":2429,"talkid":4151,"eventid":21,"role":"speaker"},{"speakerid":2447,"talkid":4107,"eventid":21,"role":"cospeaker"},{"speakerid":2451,"talkid":4137,"eventid":21,"role":"speaker"},{"speakerid":2470,"talkid":4258,"eventid":21,"role":"speaker"},{"speakerid":2487,"talkid":4302,"eventid":21,"role":"speaker"},{"speakerid":2491,"talkid":4306,"eventid":21,"role":"speaker"},{"speakerid":2497,"talkid":4508,"eventid":21,"role":"speaker"},{"speakerid":2499,"talkid":4348,"eventid":21,"role":"speaker"},{"speakerid":2502,"talkid":4416,"eventid":21,"role":"speaker"},{"speakerid":2516,"talkid":4348,"eventid":21,"role":"cospeaker"},{"speakerid":2527,"talkid":5386,"eventid":21,"role":"speaker"},{"speakerid":2536,"talkid":4680,"eventid":21,"role":"speaker"},{"speakerid":2538,"talkid":5237,"eventid":21,"role":"cospeaker"},{"speakerid":2558,"talkid":4653,"eventid":21,"role":"speaker"},{"speakerid":2585,"talkid":4791,"eventid":21,"role":"speaker"},{"speakerid":2588,"talkid":4794,"eventid":21,"role":"speaker"},{"speakerid":2588,"talkid":4795,"eventid":21,"role":"speaker"},{"speakerid":2588,"talkid":5382,"eventid":21,"role":"speaker"},{"speakerid":2604,"talkid":4795,"eventid":21,"role":"cospeaker"},{"speakerid":2604,"talkid":5382,"eventid":21,"role":"cospeaker"},{"speakerid":2606,"talkid":4653,"eventid":21,"role":"cospeaker"},{"speakerid":2607,"talkid":4654,"eventid":21,"role":"speaker"},{"speakerid":2610,"talkid":4689,"eventid":21,"role":"speaker"},{"speakerid":2613,"talkid":4891,"eventid":21,"role":"speaker"},{"speakerid":2623,"talkid":4726,"eventid":21,"role":"cospeaker"},{"speakerid":2623,"talkid":5384,"eventid":21,"role":"speaker"},{"speakerid":2641,"talkid":4794,"eventid":21,"role":"cospeaker"},{"speakerid":2660,"talkid":5142,"eventid":21,"role":"speaker"},{"speakerid":2662,"talkid":5150,"eventid":21,"role":"speaker"},{"speakerid":2668,"talkid":4869,"eventid":21,"role":"speaker"},{"speakerid":2675,"talkid":4890,"eventid":21,"role":"speaker"},{"speakerid":2689,"talkid":4968,"eventid":21,"role":"speaker"},{"speakerid":2700,"talkid":4973,"eventid":21,"role":"speaker"},{"speakerid":2707,"talkid":4973,"eventid":21,"role":"cospeaker"},{"speakerid":2721,"talkid":5224,"eventid":21,"role":"cospeaker"},{"speakerid":2727,"talkid":5123,"eventid":21,"role":"speaker"},{"speakerid":2762,"talkid":5160,"eventid":21,"role":"cospeaker"},{"speakerid":2763,"talkid":5160,"eventid":21,"role":"cospeaker"},{"speakerid":2765,"talkid":5160,"eventid":21,"role":"speaker"},{"speakerid":2773,"talkid":5178,"eventid":21,"role":"speaker"},{"speakerid":2774,"talkid":5178,"eventid":21,"role":"cospeaker"},{"speakerid":2845,"talkid":5351,"eventid":21,"role":"speaker"},{"speakerid":2848,"talkid":5298,"eventid":21,"role":"cospeaker"},{"speakerid":2853,"talkid":5360,"eventid":21,"role":"speaker"},{"speakerid":2854,"talkid":5360,"eventid":21,"role":"cospeaker"},{"speakerid":2855,"talkid":5360,"eventid":21,"role":"cospeaker"},{"speakerid":2856,"talkid":4891,"eventid":21,"role":"cospeaker"}],"updated_at":"2016-11-15 16:51:26"}